<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 应用设置
    // +----------------------------------------------------------------------
    //
    //试题配置
    //题型
    'q_type' => [
        'singlechoice' => '单选题',
        'multiplechoice' => '多选题',
        'shortanswer' => '填空题',
        'truefalse' => '判断题',
        'match' => '匹配题',
        'essay' => '简答题',
        'comprehensive' => '综合题',
        'readingcomprehension' => '阅读理解'
    ],
    //使用权限
    'q_usepermiss' => [
        '0' => '通用',
        '1' => '仅个人',
        '2' => '仅考试'
    ],
    //难度
    'q_difficulty' => [
   //     '1' => '入门',
        '1' => '容易',
        '2' => '适中',
   //     '4' => '进阶',
        '3' => '困难'
    ],
    //判断题配置
    'truefalse_con' => [
        0 => '对',
        1 => '错'
    ]

];
