<?php
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------行政区域管理----------------------------------------------------
--------------------------------------------------------------------------

-------------------获取下级所有行政区域--------------------------------------service::Area::getNextArea
//请求数据
[
    'code' => '编号,默认为根据最高级行政区域获取'
]
//返回数据（最高级别为 ['code' => 0, 'name' => '中国']）
[
    ['code' => '编号', 'name' => '名'],...
]

-------------------获取某一行政区域的所有上级行政区域代码(包括本身)--------------------------------------service::Area::getPath
//请求数据
[
    'code' => '编号'
]
//返回数据（最高级别为 ['code' => 0, 'name' => '中国'], 本次查询，不返回最高级别）
[
    'path' => ['code1', 'code2', ...]
]

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课程类型管理----------------------------------------------------------------
--------------------------------------------------------------------------

-----------------------------------获取某机构下的所有课程类型----------------------service::CourseCategoriesCon::getSonCate
//请求数据
[
    'organization' => '机构id，默认为登录用户所在的机构的id'
]
//返回数据
[
    ['id' => '类型id', 'name' => '类型名'],...
]
-----------------------------------获取某机构下与登录用户之间的所有课程类型----------------------service::CourseCategoriesCon::getSonCate
//请求数据
[
    'organization' => '机构id，默认为登录用户所在的机构的id'
]
//返回数据
[
    ['id' => '类型id', 'name' => '类型名'],...
]

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课堂管理----------------------------------------------------------
--------------------------------------------------------------------------

-----------------------创建课堂-----------------------service::ClassroomCon::addClassroom
//请求数据
[
    'fullname' => '课堂全名',
    'shortname' => '课堂简称',
    'idnumber' => '课堂编号，字母、数字、下划线',
    'summary' => '课堂简介',
    'course_id' => '继承的课程id',
    'category' => '课堂类型id',
    'numsections' => '课时，整数',
    'department' => '机构id',
    'semester' => '学期',
    'upload_files' => [//后端使用，前端不管，按前端文件上传即可
        [
            'file' => '课堂图片对象',
            'name' => '文件名',
            'summary' => '图片描述',
            'hash' => '图片哈希值'
        ]
    ]
]
//返回数据
返回成功或失败原因

-----------------------根据用户，获取课堂列表-----------------------service::ClassroomCon::userClassroom
//请求数据
[
    'id' => '用户id，为空时，默认为获取登录用户所有的课堂',
    'page' => '页数，默认为1',
    'list_rows' => '每页数据条数，默认为15'
]
//返回数据
[
    'data' => [
        [
            'id' => '课堂id',
            'fullname' => '课堂全名',
            'hortname' => '课堂简称',
            'idnumber' => '课堂编号',
            'summary' => '课堂简介',
            'classroompic' => '课堂图片id'
            'auth' => '创建者名',
            'category' => '课堂类型',
            'department' => '机构名',
            'semester' => '学期',
            'numsections' => '课时' 
        ],...
    ],
    'current_page' => '当前页码',
    'last_page' => '最后一页的页码',
    'per_page' => '每页数据条数',
    'total' => '数据总条数',
]
-----------------------课堂编辑-----------------------service::ClassroomCon::upClassroom
//请求数据
[
    'id' => '课堂id',
    'fullname' => '课堂全称',
    'shortname' => '课堂简称',
    'summary' => '课堂简介',
    'category' => '课堂类型id',
    'numsections' => '课时',
    'upload_files' => [//后端获取上传课堂图片的数据格式
        [
            'file' => 文件,
            'name' => '文件名',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        ...
    ]
]
//返回数据
返回成功或失败原因


-----------------------课堂删除-----------------------service::ClassroomCon::delClassroom
//请求数据
[
    'id' => '课堂id';
]
//返回数据
返回成功或失败原因

-------------------------课堂信息---------------------------service::ClassroomCon::getInformation
//请求数据
[
    'id' => '课堂id'
]
//返回数据
[
    'name' => '课堂名',
    'number' => '课堂人数（只是学生人数，角色为课堂下面，用户所扮演的角色）',
    'teacher' => '课堂任课老师（老师姓名，角色为课堂下面，用户所扮演老师的角色）'
]

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课堂章节管理-------------------------------------------------------
--------------------------------------------------------------------------

---------------------------章节列表----------------service::ClassroomSectionsCon::getSections
//请求数据
[
    'id' => '课堂id'
]
//返回数据
[
    [
        'id' => '课堂章id',
        'name' => '章名',
        'pid' => '父id',
        'parentstr' => '父路径',
        'type' => '0:章',
        'summary' => '章简介',
        'section' => '课时',
        'sort' => '排序',
        'children' => [
            [
                'id' => '课堂节id',
                'name' => '节名',
                'pid' => '父id',
                'parentstr' => '父路径',
                'type' => '0:节',
                'summary' => '节简介',
                'section' => '课时',
                'sort' => '排序'
            ],...
        ]
    ],
    ...
]

---------------------------章节添加----------------service::ClassroomSectionsCon::addSections
//请求数据
[
    'classroom' => '课堂id',
    'name' => '章或节名',
    'summary' => '简介',
    'pid' => '添加为节信息时，此为所在章id；添加为章信息时，此为空',
    'type' => '0:章|1:节'
    'section' => '课时',
    'sort' => '该章或节在在历史章或节中的排序'
]

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课堂用户管理----------------------------------------------------
--------------------------------------------------------------------------

-------------------------------------获取课堂下用户列表信息------------------service::ClassroomUserCon::classmateInfo
//请求数据
[
    'id' => '课堂id',
    'search' => '搜索信息，可为空',
    'page' => '页码，不传时默认为1',
    'rows' => '每页数据条数，默认为15'
]
//返回数据
[
    'data' => [
        [
            'id' => '用户id',
            'name' => '用户名',
            'number' => '学号',
            'role' => '在该课堂中的角色',
            'profession' => '专业名',
            'class' => '班级名'
        ],...
    ],
    'page' => [
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
        'per_page' => '每页数据条数',
        'total' => '数据总条数'
    ]
    
]

------------------------------------课堂下添加成员信息-----------------------service::ClassroomUserCon::addUser
//请求数据
[
    'classroom' => '课堂id',
    'type' => '1:通过班级添加|2:通过浏览用户，单个添加',
    'id' => 'type为2时：此为用户id,为数组|type为1时：此为班级id',
    'role' => '1：学生|2：老师'
]
//返回数据
返回成功或失败原因
------------------------------------课堂下成员删除---------------------------service::ClassroomUserCon::delUser
//请求数据
[
    'classroom' => '课堂id',
    'type' => '1:通过班级删除|2:通过单个用户删除',
    'id' => ['用户id1', '用户id2', ...]//type为2时，
    'id' => '班级id'//type为1时
]
//返回数据
返回成功或失败原因

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------文件上传示例----------------------------------------------------------------
--------------------------------------------------------------------------
//前端上传数据
[
    'msglist' => [//前端上传，后端没有该参数
        [
            'summary' => '文件描述',
            'file_hash' => '文件哈希值'
        ],
        ...
    ],
    'files' => ''
]
//后端接收数据
[
    'upload_files' => [
        [
            'file' => 文件,
            'name' => '文件名',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        ...
    ],
    'upload_files_hashs' => [
        'hash1', 'hash2',...
    ]
]


--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课程课件管理----------------------------------------------------------------
--------------------------------------------------------------------------

--------------------------------添加课件-----------------------service::CoursewareCon::addCourseware
//（请求数据）
[
    'course' => '课程id',
    'course_sections' => '课程章id或课程节id，可不传',
    'flag' => '0:课程的课件|1:章节的课件',
    'msglist' => [//前端上传，后端没有该参数
        [
            'summary' => '文件描述',
            'file_hash' => '文件哈希值'
        ],
        ...
    ],
    'upload_files' => [//后端获取
        [
            'file' => 文件,
            'name' => '文件名',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        ...
    ],
    'upload_files_hashs' => [
        'hash1', 'hash2',...
    ]
]
//(返回数据)
返回成功或失败原因
/*--------------------------------编辑课件-----------------------service::CoursewareCon::upCourseware
//（请求数据）
[
    'id' => '课件id',
    'summary' => '文件描述'
]*/
//（返回数据）
返回成功或失败原因
--------------------------------课件列表-----------------------service::CoursewareCon::queCourseware
//（请求数据）
[
    'id' => '课程id',
    'section' => '章或节id,该值不传时，只获取课程下的课件，传某章或节id，这只获取该章或节的课件',
]
//(返回数据)
[
    [
        'id' => '课件id',
        'name' => '课件名',
        'summary' => '文件描述',
        'type' => '文件类型',
        'path' => '课件位置id'
    ],
    ...
]
--------------------------------删除课件-----------------------service::CoursewareCon::delCourseware
//（请求数据）
[
    'id' => '课件id'
]
//(返回数据)
返回成功或失败原因

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------机构管理----------------------------------------------------------
--------------------------------------------------------------------------

-----------------------------机构编辑---------service::OrganizationCon::upOrganization
//（请求数据）
[
    'id' => '机构id',
    'name' => '机构名',
    'address' => '机构详细地址',
    'summary' => '机构简介'
]
//（返回数据）
返回成功或失败原因

-----------------------------机构列表---------service::OrganizationCon::getUserOrgAll
//（请求数据）
[
    'id' => '机构id，没有则以登录用户的最高机构为准',
]
//（返回数据）
[
    'id' => '机构id',
    'pid' => '机构pid',
    'name' => '机构名',
    'code' => '行政编号',
    'coude_name' => '行政名',
    'children' => [
        [
            'id' => '机构id',
            'pid' => '机构pid',
            'name' => '机构名',
            'code' => '行政编号',
            'coude_name' => '行政名',
            'children' => [...]
        ],
        ...
    ]
]

-------------------------机构添加--------------service::OrganizationCon::addOrganization
//请求数据
[
    'name' => '机构名',
    'address' => '机构详细地址',
    'area' => '机构所在行政区域编码',
    'org_code' => '机构编码',
    'pid' => '机构父id',
    'summary' => '机构简介'
]
//返回数据
返回成功或失败原因


--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课程管理----------------------------------------------------------------
--------------------------------------------------------------------------

-----------------------------根据课程id获取课程信息---------service::CourseCon::getCourseInfo
//（请求数据）
[
    'course' => '课程id'
]
//（返回数据）
[

]
-----------------------------课程列表---------service::CourseCon::queCourseFc
//请求数据
[
    'page' => '页数，默认为1',
    'rows' => '每页数据条数，默认为15'
]
//返回数据
[
    'current_page' => '',
    'last_page' => '',
    'per_page' => '',
    'total' => '',
    'data' => [
        [
            'id' => ''
        ],
        ...
    ]
]

--------------------------------创建课程------------------------service::CourseCon::addCourse
//请求数据
[
    'fullname' => '课程全名',
    'shortname' => '课程简称',
    'idnumber' => '课程编号',
    'numsections' => '课程课时',
    'department' => '机构id',
    'category' => '课程类型id',
    'summary' => '课程概述',
    'upload_files' => [//后端用，前端不用看
        [
            'file' => 文件,
            'name' => '文件名',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],...
    ]
]
//返回数据
返回成功或失败原因

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课程章节管理-------------------------------------------
--------------------------------------------------------------------------
-----------------------------根据课程id得到课程下的所有章节信息---------service::CourseSectionsCon::queSections
//(请求数据)
[
    'courseid' => '课程id'
]
//(返回数据)
[
    [
        'id' => '章1id',
        'pid' => '父id',
        'name' => '章名',
        'summary' => '章描述',
        'sort' => '章排序',
        'type' => '0:章|1:节',
        'section' => '课时数',
        'children' => [
            [
                'id' => '节1id',
                'pid' => '父id',
                'name' => '节名',
                'summary' => '节描述',
                'sort' => '节排序',
                'type' => '0:章|1:节',
                'section' => '课时数',
            ],
            [
                'id' => '节2id',
                'pid' => '父id',
                'name' => '节名',
                'summary' => '节描述',
                'sort' => '节排序',
                'type' => '0:章|1:节',
                'section' => '课时数',
            ]
        ]
    ],
    [
        'id' => '章2id',
        'pid' => '父id',
        'name' => '章名',
        'summary' => '章描述',
        'sort' => '章排序',
        'type' => '0:章|1:节',
        'section' => '课时数',
        'children' => [
            [
                'id' => '节1id',
                'pid' => '父id',
                'name' => '节名',
                'summary' => '节描述',
                'sort' => '节排序',
                'type' => '0:章|1:节',
                'section' => '课时数',
            ],
            [
                'id' => '节2id',
                'pid' => '父id',
                'name' => '节名',
                'summary' => '节描述',
                'sort' => '节排序',
                'type' => '0:章|1:节',
                'section' => '课时数',
            ]
        ]
    ]
]

---------------------------编辑章或节----------------------------------------service::CourseSectionsCon::upSections
//请求数据
[
    'id' => '章或节id,必需',
    'courseid' => '课程id',
    'name' => '章或节名',
    'summary' => '章或节描述'
]
//返回数据
返回成功或失败原因

----------------------------------删除章或节---------------------------------service::CourseSectionsCon::delSections
//请求数据
[
    'id' => '章或节id',
    'type' => '1:节   2：章'
]
//返回数据
返回成功或失败原因

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------文件管理----------------------------------------------------------------
--------------------------------------------------------------------------

-----------------------------获取图片---------service::AttachmentsCon::getFile
//(请求数据)
[
    'id' => '文件id',
    'type' => 'getpic:得到图片id| downgile：得到文件id',
    'width' => '图片宽度（type=getpic时，可传）'
    'height' => '图片高度（type=getpic时，可传）'
]
//(返回数据)
[
    '文件地址'
]

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------班级管理----------------------------------------------------------------
--------------------------------------------------------------------------

-----------------------------根据机构id得到该机构下的所有班级信息---------service::ClassCon::getClassForOrg
//(请求数据)
[
    'id' => '机构id'
]
//(返回数据)
[
    ['id' => '班级id', 'name' => '班级名', 'describe' => '班级描述', 'code' => '班级号'],
    ['id' => '班级id', 'name' => '班级名', 'describe' => '班级描述', 'code' => '班级号']
]

-----------------------------班级列表（搜索）---------service::ClassCon::getClass
//(请求数据)
[
    'organization' => '机构id，默认为登录用户所在的机构',
    'name' => '班级名称，默认为空'
]
//(返回数据)
[
    ['id' => '班级id', 'name' => '班级名', 'describe' => '班级描述', 'code' => '班级号'],
    ['id' => '班级id', 'name' => '班级名', 'describe' => '班级描述', 'code' => '班级号']
]
-----------------------------根据班级id编辑班级信息-----------------------service::ClassCon::upClass
//(请求数据)
[
    'id' => '班级id',
    'name' => '班级名',
    'describe' => '班级描述',
    'code' => '班级号'
]
//(返回数据)
返回成功或失败原因
-----------------------------添加班级信息---------------------------------service::ClassCon::addClass
//(请求数据)
[
    'name' => '班级名',
    'describe' => '班级描述',
    'code' => '班级号',
    'department' => '机构id',
]
//(返回数据)
返回成功或失败原因
-----------------------------删除班级---------------------------------service::ClassCon::delClass
//(请求数据)
[
    'id' => ['id1', 'id2', ...],
]
//(返回数据)
返回成功或失败原因

--------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------班级下成员管理
-----------------------------------------------------------------------------------------------------------------------------------------------

-------------------------------获取班级下的所有成员列表---------------------service::ClassCon::queClassmate
//(请求数据)
[
    'id' => '班级id',
    'number' => '学生学号，可不传',
    'username' => '账号，可不传',
    'name' => '姓名，可不传',
    'page' => '页数，默认为1',
    'rows' => '每页数据条数，默认为15'
]
//（返回数据）
[
    [
        'id' => 'id',
        'realname' => '账号',
        'realname' => '姓名',
        'email' => 'email',
        'enter_time' => '入学时间 Y-m-d ',
        'logintime' => '最近访问时间 Y-m-d H:i:s'
    ],
    ...
]
-------------------------------给班级添加成员-----------------------------------service::ClassCon::addClassmate
//(请求数据)
[
    'id' => ['id1', 'id2', 'id3',....],
    'class' => '班级id'
]
//(返回数据)
返回成功或失败原因

-------------------------------------获取指定班级之外的成员-----------------------service::ClassCon::getOtherClassUser
//(请求数据)
[
    'id' => '班级id,不传值时，获取没有班级的学生；传id时，获取该班级id之外的所有其它用户（除了管理员之外的所有用户）',
    'page' => '页码',
    'rows' => '每页数据条数，默认为15'
]
//（返回数据）
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ],
    'data' => [
        [
            'id' => '用户id',
            'username' => '用户账号',
            'realname' => '用户名',
            'number' => '学号'
        ],
        ...
    ]
]



--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------角色管理----------------------------------------------------------------
--------------------------------------------------------------------------

--------------------------------获取登录用户之下的所有角色信息------------service::DataRequest::getSonRole
//(请求数据)
[
    'id' => '可为空，为空时，为获取登陆用户下的角色信息'
]
//（返回数据）
[
    0 => [
        'id' => 'id',
        'remark' => '名'
    ],
    1 => [
        'id' => 'id',
        'remark' => '名'
    ]
]


--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------作业管理-------------------------------------------------------
--------------------------------------------------------------------------

---------------------------------------添加作业-------------------service::AssignmentCon::addHomework
//请求数据
[
    'courseid' => '课程id',
    'sectionid' => ['章或节id1', '章或节id2', '章或节id3',...],
    'idnumber' => '作业编号，（前端没有传该值时，且为添加的第一道作业时，查询该课程的编号，尾数加“001”；如果不是添加的第一道作业，则使用上次添加的最后一道作业的编号加“1”）',
    'type' => '作业类型（和试题类型使用一样的配置,目前只考虑综合题型和简答题）',
    'name' => '作业内容',
    'explain' => '作业描述',
    'hash' => '作业文件哈希值，使用逗号连接;没有文件时，为空',
    'answer' => [//题型为填空题时，该answer的count值为1，将问保存到作业表，答保存到作业答案表即可；题型为简答题时，该answer的count的值一定大于1，按试题的综合题的方式保存作业
        [
            'question' => '子问题1',
            'answer' => '子参考答案1',
            'attention' => '作业答案特别说明（可有可无）',
            'hash_question' => '子问题哈希值，使用逗号连接；没有文件时为空',
            'hash_answer' => '子答案哈希值，使用逗号连接；没有时为空'
        ],
        [
            'question' => '子问题2',
            'answer' => '子参考答案2',
            'attention' => '作业答案特别说明（可有可无）',
            'hash_question' => '子问题哈希值，使用逗号连接；没有文件时为空',
            'hash_answer' => '子答案哈希值，使用逗号连接；没有时为空'
        ],
        ...
    ],
    'msglist' => [//前端有文件上传时需要必须上传的文件描述信息的格式，后端查看不用理会该信息
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述,没有文件时，为空',
        ],
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述，没有文件时为空',
        ],
        ...
    ],
    'upload_files' => [//有文件上传时，后端接收到的文件数据格式，前端不用理会该信息
        0 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        1 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ],
    'upload_files_hashs' => [//有文件上传时，后端接收到的文件数据格式，前端不用理会该信息
        ['文件1哈希值'], ['文件2哈希值'], ...
    ]
]
//返回数据
返回成功或失败原因


----------------------------------编辑作业----------------------------------service::AssignmentCon::uphomework
//请求数据
[
    'id' => '作业id',
    'name' => '作业内容',
    'type' => '作业类型（原作业是什么题型，编辑后的作业类型不变）',
    'explain' => '作业描述',
    'del_hash' => '用户删除了的文件的id；     包括问题本身，答案，子问题的所有文件的id，使用逗号连接',
    'add_hash' => '作业文件哈希值，使用逗号连接;没有文件时，为空;编辑新增文件时，有值',
    'answer' => [//题型为填空题时，该answer的count值为1，将问保存到作业表，答保存到作业答案表即可；题型为简答题时，该answer的count的值一定大于1，按试题的综合题的方式保存作业
        [
            'question_id' => '问题id',
            'question' => '子问题1',
            'answer_id' => '子答案id',
            'answer' => '子参考答案1',
            'attention' => '作业答案特别说明（可有可无）',
            'add_hash_question' => '子问题哈希值，使用逗号连接；没有文件时为空;  新增文件哈希值',
            'add_hash_answer' => '子答案哈希值，使用逗号连接；没有时为空;  新增文件哈希值'
        ],
        [
            'question_id' => '问题id,可为空，为空时，为新增数据',
            'question' => '子问题2',
            'answer_id' => '子答案id，可为空，为空时，为新增时间',
            'answer' => '子参考答案2',
            'attention' => '作业答案特别说明（可有可无）',
            'add_hash_question' => '子问题哈希值，使用逗号连接；没有文件时为空;  新增文件哈希值',
            'add_hash_answer' => '子答案哈希值，使用逗号连接；没有时为空;  新增文件哈希值'
        ],
        ...
    ],
    'msglist' => [//前端有文件上传时需要必须上传的文件描述信息的格式，后端查看不用理会该信息    有新增文件时
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述,没有文件时，为空',
        ],
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述，没有文件时为空',
        ],
        ...
    ],
    'upload_files' => [//有文件上传时，后端接收到的文件数据格式，前端不用理会该信息    有新增文件时
        0 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        1 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ],
    'upload_files_hashs' => [//有文件上传时，后端接收到的文件数据格式，前端不用理会该信息
        ['新增文件1哈希值'], ['新增文件2哈希值'], ...
    ]
]
//返回数据
返回成功或失败原因

--------------------------------------作业列表---------------------service::AssignmentCon::list
//请求数据
[
    'id' => '课程id',
    'sectoins' => '课程某章或节id，可为空，使用逗号连接多个id',
    'name' => '作业名搜索，可为空',
    'page' => '页数，默认为1',
    'rows' => '每页数据条数，默认为15'
]
//返回数据
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ],
    'data' => [
        [
            'id' => '作业id',
            'name' => '作业名',
            'author' => '创建者',
            'createtime' => '创建时间：XXXX（年）-XX（月）-XX（日）',
            'createtimestamp' => '创建时间：时间戳'
        ],
        ...
    ]
]

--------------------------------------作业详情---------------------service::AssignmentCon::getInfo
//请求数据
[
    'id' => '作业id'
]
//返回数据
[
    'id' => '作业id',
    'courseid' => '课程id',
    'coursename' => '课程全名',
    'sectionid' => [
        '章或节id1', '章或节id2',...
    ],
    'name' => '作业名',
    'explain' => '作业描述',
    'auth' => '作者名',
    'idnumber' => '作业编号',
    'createdtimestamp' => '添加时间戳',
    'modifiedtimestamp' => '修改时间戳',
    'createdtime' => '添加时间 格式：XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒）',
    'modifiedtime' => '修改时间 格式：XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒）',
    'file' => [
        [//文件1
            'id' => '作业文件id',
            'name' => '作业文件名',
            'file_type' => '文件类型',
            'summary' => '作业文件描述',
            'attachments' => '地址id'
        ],
        ...
    ],
    'type' => '作业题型（目前只有简答和综合题型）'
    'homework' => [//题型为综合题型时
        [//子问题1
            'id' => '子问题1id',
            'name' => '子作业名',
            'explain' => '子作业描述',
            'idnumber' => '子作业编号',
            'file' => [
                [//文件1
                    'id' => '作业文件id',
                    'name' => '作业文件名',
                    'file_type' => '文件类型',
                    'summary' => '作业文件描述',
                    'attachments' => '地址id'
                ],
                ...
            ],
            'answer' => [
                'id' => '子答案id',
                'answer' => '子答案',
                'attention' => '子答案特别说明',
                'file' => [
                    [//文件1
                        'id' => '答案文件id',
                        'name' => '答案文件名',
                        'file_type' => '文件类型',
                        'summary' => '作业文件描述',
                        'attachments' => '地址id'
                    ],
                    ...
                ]
            ]
        ],
        ...
    ],
    'homework' => [//题型为简答题时
        'id' => '答案id',
        'answer' => '答案',
        'attention' => '答案特别说明',
        'file' => [
            [
                'id' => '答案id',
                'name' => '答案文件名',
                'file_type' => '文件类型',
                'summary' => '作业文件描述',
                'attachments' => '地址id'
            ]
        ]
    ]
]

------------------------------------作业删除-------------------------service::AssignmentCon::del
//请求数据
[
    'id'=> '作业id'
]
//返回数据
返回成功或失败原因


--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课堂----------------------------------------------------------------
--------------------------------------------------------------------------

资源选择
[

]

课堂添加作业（老师）
[
    'classroomid' => '课堂id',
    'sectionid' => '课堂章或节id',
    'homework' => [
        'type' => '作业类型',
        'name' => '作业名',
        'explain' => '作业描述'
    ],
    'answer' => [
        [
            'answer' => '答案',
            'attention' => '答案特别描述'
        ],
        [
            'answer' => '答案',
            'attention' => '答案特别描述'
        ]
    ],
    //前端上传格式
    'msglist' => [
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ]
    //后端接收格式
    'upload_files' => [
        0 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        1 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ],
    'upload_files_hashs' => [
        0 => [''],
        1 => ['']
    ]
]


课堂编辑作业（老师）
[
    'classroomid' => '课程id(必须）',
    'sectionid' => '课堂作业所在章节id（必须有章或节的id）',
    'homework' =>[
        'name' => '作业名',
        'explain' => '作业描述',
        'id' => '作业id',
        'delfile' => [
            '需要删除文件的id1', '需要删除文件的id2'
        ]
    ],
    'answer' => [
        [
            'answer' => '作业答案（必须）',
            'attention' => '作业答案特别说明（可有可无）',
            'id' => '作业答案id',
            'files' => [
                [
                    'id' => '作业文件id',
                    'summary' => '作业文件描述'
                ],
                [
                    'id' => '作业文件id',
                    'summary' => '作业文件描述'
                ]
            ],
            'delfile' => [
                '需要删除文件的id1'， '需要删除文件的id2'
            ]
        ],
        [
            'answer' => '作业答案（必须）',
            'attention' => '作业答案特别说明（可有可无）',
            'id' => '作业答案id',
            'files' => [
                [
                    'id' => '作业文件id',
                    'summary' => '作业文件描述'
                ],
                [
                    'id' => '作业文件id',
                    'summary' => '作业文件描述'
                ]
            ],
            'delfile' => [
                '需要删除文件的id1'， '需要删除文件的id1'
            ]
        ]
    ],
    //前端上传格式
    'msglist' => [
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ]
    //后端接收格式
    'upload_files' => [
        0 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        1 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ],
    'upload_files_hashs' => [
        0 => [''],
        1 => ['']
    ]
]

课堂查看作业列表（老师）
[
    'id' => '课堂id（必须）',
    'section' => '课堂章或节id（无：查询课堂下所有章或节；有：只查询某章或某节）',
    'issue' => '是否发布，0：未发布|1发布；（默认为空时，查询已经发布和未发布所有的）',
    'announce_answer' => '是否公布答案，0：不公布答案|1：公布答案；（默认为空，表示查询所有的，只有已经发布了的才会有1的情况）',
    'page' => '页数（默认为1）',
    'row' => '请求返回的数据条数（默认为15）',
]
课堂搜索作业，返回的还是作业列表（老师或学生）
[
    'name' => '作业名',
    'time' => '发布时间，单位是天（查询某一天发布的作业即0时0分0秒到23时59分59秒之间发布的作业）'
]


课堂查看作业详情（老师或学生）
[
    'id' => '作业id',
    'classroomid' => '课堂id',
    'section' => '章或节id'
]

课堂删除作业（老师）
[
    [
        'id' => '作业id'，
        'classroomid' => '课堂id（必传）'，
        'section' => '章id|节id（必传）'
    ],
    [
        'id' => '作业id'，
        'classroomid' => '课堂id（必传）'，
        'section' => '章id|节id（必传）'
    ]
]

课堂作业发布
[
    'id' => '作业id',
    'classroomid' => '课堂id',
    'sectionid' => '章节id',
    'dosubmit' => '允许重复提交次数；1（默认）：不允许重复提交；2：允许重复提交2次；最大可允许重复提交10次',
    'timeopen' => '作业开始时间',
    'timeclose' => '作业结束时间',
    'attention' => '发布作业特别说明',
    'score' => '作业满分值'
]



返回数据格式
课堂添加和编辑和删除
返回成功或失败

课堂作业列表查询(老师)
[
    'current_page' => '当前页码',
    'last_page' => '最后一页的页码',
    'per_page' => '每页数据条数',
    'total' => '数据总条数',
    'data' => [
        [
            'id' => '作业id',
            'sectionid' => '章或节id',
            'sectionname' => '章或节名',
            'name' => '作业名',
            'type' => '作业类型',
            'innumber' => '作业编号',
            'issue' => '是否发布，0：未发布|1发布',
            'announce_answer' => '是否公布答案，0：不公布答案|1：公布答案'
        ],
        [
            'id' => '作业id',
            'sectionid' => '章或节id',
            'sectionname' => '章或节名',
            'name' => '作业名',
            'type' => '作业类型',
            'innumber' => '作业编号',
            'issue' => '是否发布，0：未发布|1发布',
            'announce_answer' => '是否公布答案，0：不公布答案|1：公布答案'
        ]
    ]
]

课堂作业详情查询（老师）
[
    'classroomid' => '课堂id',
    'classroomname' => '课堂全名'，
    'sectionid' => '章节id',
    'sectionname' => '章或节名'
    'courseid' => '课程id',
    'coursename' => '课程全名',
    'homework' => [
        'id' => '作业id',
        'innumber' => '作业编号',
        'type' => '作业类型',
        'name' => '作业名',
        'explain' => '作业描述',
        'issue' => '是否发布，0：未发布|1:发布',
        'announce_answer' =>'是否公布答案，0：不公布答案|1：公布答案',
        'issuemessage' => [
            'dosubmit' => '作业可重复提交次数',
            'attention' => '布置作业特别说明',
            'score' => '作业满分值',
            'starttime' => '作业开始时间:XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒）',
            'closetime' => '作业结束时间:XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒）',
        ],
        'createdtime' => '作业创建时间:XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒）',
        'modifiedtime' => '上传作业修改时间:XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒）',
        'authname' => '该作业创建者名',
        'files' => [
            [
                'id' => '文件id',
                'name' => '文件名',
                'summary' => '文件描述',
                'type' => '文件类型',
                'attachments' => '文件请求地址id'
            ],
            [
                'id' => '文件id',
                'name' => '文件名',
                'summary' => '文件描述',
                'type' => '文件类型',
                'attachments' => '文件请求地址id'
            ]
        ]
    ],
    'answer' => [
        'answer' => [
            [
                'id' => '答案id',
                'answer' => '答案',
                'attention' => '答案特别描述',
            ],
            [
                'id' => '答案id',
                'answer' => '答案',
                'attention' => '答案特别描述',
            ]
        ],
        'files' => [
            [
                 'id' => '文件id',
                'name' => '文件名',
                'summary' => '文件描述',
                'type' => '文件类型',
                'attachments' => '文件请求地址id'
            ],
            [
                'id' => '文件id',
               'name' => '文件名',
                'summary' => '文件描述',
                'type' => '文件类型',
                'attachments' => '文件请求地址id'
            ]
        ]
    ]
]
课堂作业列表查询（学生）
[
    'current_page' => '当前页码',
    'last_page' => '最后一页的页码',
    'per_page' => '每页数据条数',
    'total' => '数据总条数',
    'data' => [
        [
            'id' => '作业id',
            'sectionid' => '章或节id',
            'sectionname' => '章或节名',
            'name' => '作业名',
            'type' => '作业类型',
            'innumber' => '作业编号',
            'announce_answer' => '是否公布答案，0：不公布答案|1：公布答案',
            'closetime' => '作业完成时间（XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒））'
        ],
        [
            'id' => '作业id',
            'sectionid' => '章或节id',
            'sectionname' => '章或节名',
            'name' => '作业名',
            'type' => '作业类型',
            'innumber' => '作业编号',
            'announce_answer' => '是否公布答案，0：不公布答案|1：公布答案',
            'closetime' => '作业完成时间（XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒））'
        ]
    ]
]
课堂作业详情查询（学生）
[
    'classroomid' => '课堂id',
    'classroomname' => '课堂全名'，
    'sectionid' => '章节id',
    'sectionname' => '章或节名'
    'homework' => [
        'id' => '作业id',
        'innumber' => '作业编号',
        'type' => '作业类型',
        'name' => '作业名',
        'explain' => '作业描述',
        'authname' => '该作业创建者名',
        'dosubmit' => '作业可重复提交次数',
        'attention' => '作业特别要求说明',
        'score' => '作业满分值',
        'timestampstart' => '作业开始时间戳',
        'timestampclose' => '作业结束时间戳',
        'timeopen' => '作业开始时间（XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒））',
        'timeclose' => '作业截止时间（XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒））',
        'files' => [
            [
                'id' => '文件id',
                'name' => '文件名',
                'summary' => '文件描述',
                'type' => '文件类型',
                'attachments' => '文件请求地址id'
            ],
            [
                'id' => '文件id',
                'name' => '文件名',
                'summary' => '文件描述',
                'type' => '文件类型',
                'attachments' => '文件请求地址id'
            ]
        ]
    ],
    'answer' => [
        'oneself' => [
            'answer' => [
                'id' => '答案id',
                'answer' => '答案',
                'attention' => '答案特别说明',
                'dosubmit' => '目前提交次数',
                'correctingtime' => '老师批改作业时间（XXXX（年）-XX（月）-XX（日） XX（时）：XX（分）：XX（秒））',
                'comment' => '老师对该答案的评语',
                'grade' => '答案得分'
            ],
            'files' => [
                [
                    'id' => '文件id',
                    'name' => '文件名',
                    'summary' => '文件描述',
                    'type' => '文件类型',
                    'attachments' => '文件请求地址id'
                ],
                [
                    'id' => '文件id',
                    'name' => '文件名',
                    'summary' => '文件描述',
                    'type' => '文件类型',
                    'attachments' => '文件请求地址id'
                ]
            ]
        ],
        'reference' => [
            'answer' => [
                [
                    'id' => '答案id',
                    'answer' => '答案',
                    'attention' => '答案特别描述',
                ],
                [
                    'id' => '答案id',
                    'answer' => '答案',
                    'attention' => '答案特别描述',
                ]
            ],
            'files' => [
                [
                    'id' => '文件id',
                    'name' => '文件名',
                    'summary' => '文件描述',
                    'type' => '文件类型',
                    'attachments' => '文件请求地址id'
                ],
                [
                    'id' => '文件id',
                    'name' => '文件名',
                    'summary' => '文件描述',
                    'type' => '文件类型',
                    'attachments' => '文件请求地址id'
                ]
            ]
        ]
    ]
]
课堂作业提交答案-请求（学生）
[
    'classroomid' => '课堂id',
    'sectionid' => '章节id',
    'id' => '作业id',
    'answer' => [
        'answer' => '答案',
        'attention' => '作业答案特别说明（可有可无）',
    ],
    //前端上传格式
    'msglist' => [
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ]
    //后端接收格式
    'upload_files' => [
        0 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        1 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ],
    'upload_files_hashs' => [
        0 => [''],
        1 => ['']
    ]
]
课堂作业编辑答案-请求（学生）
[
    'classroomid' => '课堂id',
    'sectionid' => '章节id',
    'id' => '作业id',
    'answer' => [
        'answer' => '答案',
        'attention' => '作业答案特别说明（可有可无）',
        'id' => '答案id',
        'files' => [
            [
                'id' => '作业文件id',
                'summary' => '作业文件描述'
            ],
            [
                'id' => '作业文件id',
                'summary' => '作业文件描述'
            ]
        ],
        'delfile' => [
            '需要删除文件的id1', '需要删除文件的id2'
        ]
    ],
    //前端上传格式
    'msglist' => [
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        [
            'hash' => '文件哈希值',
            'summary' => '文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ]
    //后端接收格式
    'upload_files' => [
        0 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ],
        1 => [
            'file' => Object（上传文件对象）,
            'name' => '上传文件名',
            'hash' => '上传文件哈希值',
            'summary' => '上传文件描述',
            'flag' => 'homework(代表作业的文件)|answer（代表答案的文件）'
        ]
    ],
    'upload_files_hashs' => [
        0 => [''],
        1 => ['']
    ]
]
课堂作业查看学生完成情况(默认取所有学生)-请求（老师）
[
    'id' => '作业id',
    'classroomid' => '课堂id',
    'sectionid' => '章节id',
]
课堂作业查看学生完成情况-返回
[
    'id' => '作业id',
    'classroomid' => '课堂id',
    'classroomname' => '课堂名',
    'sectionid' => '章节id',
    'sectionname' => '章或节名',
    'name' => '作业名',
    'statistics' => [
        'total' => '总人数',
        'finished' => '完成人数',
        'unfinished' => '未完成人数'
    ]
    'student' => [
        'finished' => [
            'student' => [
                [
                    'id' => '学生id',
                    'realname' => '学生名',
                    'idnumber' => '学号',
                    'grade' => '得分'
                ],
                [
                    'id' => '学生id',
                    'realname' => '学生名',
                    'idnumber' => '学号',
                    'grade' => '得分'
                ]
            ],
            'statistics' => [
                'average' => '平均分',
                'lowest' => '最低分',
                'highest' => '最高分'
            ]
        ],
        'unfinished' => [
            [
                'id' => '学生id',
                'realname' => '学生名',
                'idnumber' => '学号',
                'grade' => '0'
            ],
            [
                'id' => '学生id',
                'realname' => '学生名',
                'idnumber' => '学号',
                'grade' => '0'
            ]
        ]

    ]
]
课堂作业查看学生完成情况()-请求（老师）

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------用户管理----------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------

----------------------------------用户列表----------------------------------------Service::User_Con::getUserList
//请求用户列表
[
    'role' => '默认为空时，获取所有用户。  student:学生角色；teacher:老师角色'
    'page' =>'页数',
    'rows' => '条数'
]
//返回用户列表----默认获取所有人员
[
    'total' => '数据总条数',
    'per_page' => 5,
    'current_page' => 1,
    'last_page' => 1,
    'data' => [
        'id' => '用户id'
        'username' => '用户账户',
        'realname' => '用户名',
        'org' => '机构名',
        'idnumber' => '学号'，
        'email' => '邮箱',
        'education' => '学历',
        'starttime' => '入学\入职时间：2017/11/21',
        'prevtime' => '上次访问：2017/10/21'
    ],
    [
        'id' => '用户id'
        'username' => '用户账户',
        'realname' => '用户名',
        'org' => '机构名',
        'email' => '邮箱',
        'education' => '学历',
        'starttime' => '入学\入职时间：2017/11/21',
        'prevtime' => '上次访问：2017/10/21'
    ]
]
----------------------------------用户详情----------------------------------------Service::User_Con::getUserInfoId
//请求用户详情
[
    'id' => '用户id'
]
//返回用户详情
[
    'id' => '用户id'
    'username' =>  '登陆',
    'realname' =>  '用户名',
    'sex' =>  '性别1:男|2:女',
    'idnumber' =>  'Y007',
    'email' =>  '邮箱',
    'phone' =>  '手机号码',
    'org_id' =>  '机构id',
    'org_name' =>  [
        ['name' => '机构名'],
        ['name' => '机构名']
    ],
    'address' =>  '地址',
    'description' =>  '个人描述',
    'education' => : '学历0：小学|1：初中|2：高中|3：中专|4：大专|5：本科|6：硕士|7：博士',
    'class_id' =>  '班级id',
    'class_name' =>  '班级名',
    'enter_time' =>  '入学时间/入职时间 ：2014年9月1日',
    'pro' => [
        'sign' => [
            'id' => '专业id',
            'name' => '专业名'
        ],
        'sign' => [
            'id' => '专业id',
            'name' => '专业名'
        ]
    ],
    'picture' => '头像id'
]
-------------------------------添加用户（单个）---------------service::UserCon::addUser
//添加用户
[
    'username' => '用户名',
    'realname' => '真实名',
    'idnumber' => '编号',
    'sex' => '性别1:男|2:女',
    'password' => '密码 6-12位',
    'checkpassword' => '重复密码，和password值一样',
    'email' => '邮箱',
    'phone' => '电话',
    'enter_time' => '入学时间/入职时间:时间戳',
    'education' => '学历',
    'description' => '个人描述',
    'address' => '地址',
    'org_id' => '机构id',
    'role' => '角色id',
    'professional' => [
        '第一专业id', '第二专业id'
    ],
    'class' => '班级id',
    'files' => 只有前端文件上传使用，有图片上传，使用，没有图片上传，可用可不用,
    'upload_files' => [//·只有后端使用  有文件上传时，后端得到的数据
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ]
    ]
]
//返回数据
返回成功或失败

-----------------------------批量添加用户(excel表格导入)---------service::UserCon::InsertExcel
//（请求数据）
[
    'organization' => '机构id',
    'class' => '班级id',
    'profession' => [
        '专业id1', '专业id2'
    ],
    'role' => '角色id',
    /*'upload_files' => [
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ]
    ]*/
]
//（返回数据-操作成功）
[
    'msg' => '总??条，成功??条，失败??条。',
    'fail_data' => [
        ['name' => '姓名', 'idnumber' => '学号', 'msg' => '失败原因'],
        ['name' => '姓名', 'idnumber' => '学号', 'msg' => '失败原因']
    ]
]
//（返回数据-操作失败）
[
    '失败信息描述'
]
-----------------------------用户编辑---------service::UserCon::upUser
//编辑用户
[
    'id' => '用户id'
    'username' =>  '登陆账户',
    'realname' =>  '用户名',
    'sex' =>  '性别1:男|2:女',
    'idnumber' =>  '用户编号',
    'password' => '无密码修改时，此字段可为空',
    'checkpassword' => 'password为空时，此字段为空；password不为空时，此字段不为空',
    'email' =>  '邮箱',
    'phone' =>  '手机号码',
  //  'org_id' =>  '机构id',
 //   'org_name' =>  '机构名',
    'address' =>  '地址',
    'description' =>  '个人描述',
    'education' =>  '学历0：小学|1：初中|2：高中|3：中专|4：大专|5：本科|6：硕士|7：博士',
    'class_id' =>  '班级id，可修改用户班级id，没修改，使用原班级id',
  //  'class_name' =>  '班级名',
    'enter_time' =>  '入学时间/入职时间 ：2014年9月1日',
    'files' => 只有前端文件上传使用，有图片上传，使用，没有图片上传，可用可不用,
    'upload_files' => [//·只有后端使用  有文件上传时，后端得到的数据
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ]
    ]
]
-----------------------------用户登录---------service::Index::checklogin
//请求数据
[
    'username' => '登陆账户',
    'userpwd' => '登陆密码'
]
//返回数据
[

    'uid' => '用户id',
    'username' => '用户账户',
    'idnumber' => '用户编号',
    'pid' => '机构id',
    'address' => '地址',
    'picture' => '图片地址',
    'description' => '描述',
    'education' => '学历',
    'enter_time' => '入学时间',
    'logintime' => '上次登录时间 Y-m-d H:i:s',
    'access_list' => '权限列表',
    'org_name' => '机构名',
    'role' => '角色名'
]

----------------------------密码认证-------------------------service::UserCon::checkPassword
//请求数据
[
    'pass' => '密码'
]
//返回数据
[
    'result' => '0: 密码错误   1：密码正确'
]

----------------------------密码修改-------------------------service::UserCon::upPassword
//请求数据
[
    'pass' => '旧密码',
    'modpass' => '新密码'
]
//返回数据
返回成功或失败原因


--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------专业管理----------------------------------------------------------------
--------------------------------------------------------------------------

-------------------专业列表-------------------service::ProfessionCon::index
//（请求数据）
[
    'organization' => '机构id',
    'name' => '专业名'
]
[
    [
        'id' => '专业id',
        'name' => '专业名',
        'code' => '专业编号'
    ],
    [
        'id' => '专业id',
        'name' => '专业名',
        'code' => '专业编号'
    ]
]


---------------------专业下人员管理-------
---------------------添加人员---------service::
//(请求数据)
[
    'id' => '专业id',
    'user' => [
        'uid1', 'uid2'
    ]
]
//（返回数据）
[]
----------------------获取指定专业之外的成员---------service::
//（请求数据）
[
    'id' => '专业id',
    'page' => '页码（可不传）',
    'rows' => '每页数据条数（可不传）'
]
//（返回数据）
[]
----------------------删除指定专业下的成员----------service::
//（请求数据）
[
    'id' => '专业id',
    'user_id' => [
        'id1', 'id2'
    ]
]
//(返回数据)


--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课程试题----------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------

-----------------------------------添加试题（返回true或false）------------exam::Question::addQuestion
//单选-多选-添加
[
    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',
    'diff' => '难度',
    'usepermise' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' => [//为json字符串
        {"name":"答案","fraction":"正确答案标记","tab":"选项标记","files_hash":"图片哈希值（无图片上传时为空或无该字段）"},...
    ],
    /*'answer' => [
        [
            'name' => '答案',
            'fraction' => '正确答案标记',
            'tab' => '选项标记',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）'
        ],
        [
            'name' => '答案',
            'fraction' => '100',//100
            'tab' => '选项标记',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）'
        ],
        ...
    ],*/
    'msglist' => [//只用于前端
        {"file_hash":"图片哈希值","summary":"该图片的描述"},...
    ],
    'files_hash' => ["图片哈希值1","图片哈希值2",...];//为json字符串，（无图片上传时为空或无该字段，题干的图片哈希值）
    /*'files_hash' => [//
        '图片哈希值1', '图片哈希值2'
    ],*/
    'upload_files' => [//（无图片上传时为空或无该字段）,只用于后端
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ],
    'upload_files_hashs' => [//只用于后端，所有图片的哈希值
        '图片哈希值1', '图片哈希值2'
    ]
]
//填空-添加
[
    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' => [
        '答案1','答案2','答案3'
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//判断-添加
[
    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' => [
        'fraction' => 0:对|1：错
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//匹配-添加
[
    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'option' => [
        [
            'name' => '问题',
            'answer' => '答案'
        ],
        [
            'name' => '问题',
            'answer' => '答案'
        ],
        ...
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//简答-添加
[
    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' = '参考答案',
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//综合-添加
[
    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'option' => [
        [
            'name' => '问题1',
            'answer' => '参考答案'
        ],
        [
            'name' => '问题2',
            'answer' => '参考答案'
        ],
        ...
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//阅读理解-添加
[
    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'option' => [
        [
            'qtype' => '题型-选择',
            'name' => '问题',
            'answer' => [
                [
                    'name' => '答案',
                    'fraction' => '正确答案标记',
                    'tab' => '选项标记',
                    'files_hash' => '图片哈希值（无图片上传时为空或无该字段）'
                ],
                [
                    'name' => '答案',
                    'fraction' => '正确答案标记',
                    'tab' => '选项标记',
                    'files_hash' => '图片哈希值（无图片上传时为空或无该字段）'
                ]
            ],
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）'
        ],
        [
            'qtype' => '题型-判断',
            'name' => '问题',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）',
            'answer' => [
                'fraction' => 0:对|1：错
            ]
        ],
        [
            'qtype' => '题型-填空',
            'name' => '问题',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）',
            'answer' => [
                '答案1', '答案2', '答案3'
            ]
        ],
        [
            'qtype' => '题型-简答',
            'name' => '问题',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）',
            'answer' => '答案'
        ]
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
---------------------------编辑试题（返回true或false）----------------------------------exam::Question::upQuestion
//请求
//选择
[
    'id' => '试题id',
/*    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',*/
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' => [
        [
            'id' => '答案id',
            'name' => '答案',
            'fraction' => '正确答案标记',
            'tab' => '选项标记',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）'
        ],
        [
            'id' => '答案id',
            'name' => '答案',
            'fraction' => '100',//100
            'tab' => '选项标记',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）'
        ],
        ...
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//填空
[
    'id' => '题id',
/*    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',*/
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' => [
        '子id' => '答案1',
        '子id' => '答案2',
        '子id' => '答案3'
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//判断
[
    'id' => '题id'
/*    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',*/
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' => [
        'id' => '答案id',
        'fraction' => 0:对|1：错
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//匹配
[
    'id' => '题id'
/*    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',*/
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'option' => [
        [
            'id' => '子id'
            'name' => '问题',
            'answer' => '答案'
        ],
        [
            'id' => '子id'
            'name' => '问题',
            'answer' => '答案'
        ],
        ...
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//简答
[
    'id' => '题id',
/*    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',*/
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'answer' => '参考答案',
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//综合-添加
[
    'id' => '题id'
/*,    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',*/
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'option' => [
        [
            'id' => '子id',
            'name' => '问题1',
            'answer' => '参考答案'
        ],
        [
            'id' => '子id',
            'name' => '问题2',
            'answer' => '参考答案'
        ],
        ...
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
//阅读理解
[
    'id' => '题id',
/*    'qtype' => '题型',
    'course' => '课程id',
    'section' => '章id',
    'sections' => '节id',*/
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '题目',
    'generalfeedback' => '试题解析',
    'option' => [
        [
            'id' => '子id',
            'qtype' => '题型-选择',
            'name' => '问题',
            'answer' => [
                [
                    'id' => '答案id'，
                    'name' => '答案',
                    'fraction' => '正确答案标记',
                    'tab' => '选项标记',
                    'files_hash' => '图片哈希值'
                ],
                [
                    'id' => '答案id',
                    'name' => '答案',
                    'fraction' => '正确答案标记',
                    'tab' => '选项标记',
                    'files_hash' => '图片哈希值1'
                ]
            ],
            'files_hash' => [//（无图片上传时为空或无该字段）
                '图片哈希值1', '图片哈希值2'
            ]
        ],
        [
            'id' => '子id',
            'qtype' => '题型-判断',
            'name' => '问题',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）',
            'answer' => [
                'id' => '答案id',
                'fraction' => 0:对|1：错
            ],
        ],
        [
            'id' => '子id',
            'qtype' => '题型-填空',
            'name' => '问题',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）',
            'answer' => [
                '答案id' => '答案1',
                '答案id' => '答案2',
                '答案id' => '答案3'
            ],
        ],
        [
            'id' => '子id',
            'qtype' => '题型-简答',
            'name' => '问题',
            'files_hash' => '图片哈希值（无图片上传时为空或无该字段）',
            'answer' => [
                '答案id' => '答案'
            ]
        ]
    ],
    'files_hash' => [//（无图片上传时为空或无该字段）
        '图片哈希值1', '图片哈希值2'
    ],
    'upload_files' => [//（无图片上传时为空或无该字段）
        0 => [
            'file' => Tp5 request()->file() 得到的file对象,
            'name' => '文件上传的名字',
            'hash' => '文件哈希值',
            'summary' => '文件描述'
        ],
        1 => [
            同上
        ]
    ]
]
---------------------------查询试题详情---------------------------------------exam::Question::queQuestion

//某一个题
//（接受数据）
[
    'id' => '题id'
]

//(选择题-返回数据)
[
    'id' => '',
    'qtype' => '题型',
    'course' => '课程名',
    'section' => '章名',
    'sections' => '节名',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '试题名生成的试题简介',
    'questiontext' => '题目',
    'generalfeedback' => '试题解析',
    'auth' => '添加者',
    'createtime' => '添加时间 Y-m-d',
    'imgs' => [
        '图片id1', '图片id2'
    ],
    'check' => '审核状态',
    'answer' => [
        [
            'id' => '',
            'name' => '答案',
            'fraction' => '正确答案标记',//值为100的为正确答案
            'tab' => '选项标记',
            'imgs' => '图片id'
        ],
        [
            'id' => '',
            'name' => '答案',
            'fraction' => '正确答案标记',//值为空或其它的为错误答案
            'tab' => '选项标记',
            'imgs' => '图片id'
        ],
        ...
    ],
    'check_msg' => '当审核状态未通过时，该字段值未question_check表的text字段的值；否则无该字段'
]
//填空
//填空-返回数据
[
    'id' => '题id',
    'qtype' => '题型',
    'course' => '课程名',
    'section' => '章名',
    'sections' => '节名',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '试题名生成的试题简介',
    'questiontext' => '题目',
    'generalfeedback' => '试题解析',
    'auth' => '添加者',
    'createtime' => '添加时间 Y-m-d',
    'imgs' => [
        '图片id1', '图片id2'
    ],
    'check' => '审核状态',
    'answer' => [
        '答案id' => '答案1',
        '答案id' => '答案2',
        '答案id' => '答案3'
    ],
    'check_msg' => '当审核状态未通过时，该字段值未question_check表的text字段的值；否则无该字段'
]
//判断-返回数据
[
    'id' => '题id',
    'qtype' => '题型',
    'course' => '课程名',
    'section' => '章名',
    'sections' => '节名',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '试题名生成的试题简介',
    'questiontext' => '题目',
    'generalfeedback' => '试题解析',
    'auth' => '添加者',
    'createtime' => '添加时间 Y-m-d',
    'answer' => [
        'id' => '答案id',
        'fraction' => 0:对|1：错
    ],
    'imgs' => [
        '图片id1', '图片id2'
    ],
    'check' => '审核状态',
    'check_msg' => '当审核状态未通过时，该字段值未question_check表的text字段的值；否则无该字段'
]
//匹配-返回数据
[
    'id' => '题id'，
    'qtype' => '题型',
    'course' => '课程名',
    'section' => '章名',
    'sections' => '节名',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '试题名生成的试题简介',
    'questiontext' => '题目',
    'generalfeedback' => '试题解析',
    'auth' => '添加者',
    'createtime' => '添加时间 Y-m-d',
    'option' => [
        [
            'id' => '子id',
            'name' => '问题',
            'answer' => '答案'
        ],
        [
            'id' => '子id',
            'name' => '问题',
            'answer' => '答案'
        ],
        ...
    ],
    'imgs' => [
        '图片id1', '图片id2'
    ],
    'check' => '审核状态',
    'check_msg' => '当审核状态未通过时，该字段值未question_check表的text字段的值；否则无该字段'
]
//简答-返回数据
[
    'id' => '题id',
    'qtype' => '题型',
    'course' => '课程名',
    'section' => '章名',
    'sections' => '节名',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '试题名生成的试题简介',
    'questiontext' => '题目',
    'answer' => '参考答案',
    'generalfeedback' => '试题解析',
    'auth' => '添加者',
    'createtime' => '添加时间 Y-m-d',
    'imgs' => [
        '图片id1', '图片id2'
    ],
    'check' => '审核状态',
    'check_msg' => '当审核状态未通过时，该字段值未question_check表的text字段的值；否则无该字段'
]
//综合-返回数据
[
    'id' => '题id'，
    'qtype' => '题型',
    'course' => '课程名',
    'section' => '章名',
    'sections' => '节名',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '试题名生成的试题简介',
    'questiontext' => '题目',
    'generalfeedback' => '试题解析',
    'auth' => '添加者',
    'createtime' => '添加时间 Y-m-d',
    'option' => [
        [
            'id' => '子id',
            'name' => '问题1',
            'answer' => '参考答案'
        ],
        [
            'id' => '子id',
            'name' => '问题2',
            'answer' => '参考答案'
        ],
        ...
    ],
    'imgs' => [
        '图片id1', '图片id2'
    ],
    'check' => '审核状态',
    'check_msg' => '当审核状态未通过时，该字段值未question_check表的text字段的值；否则无该字段'
]
//阅读理解-返回数据
[
    'id' => '题id',
    'qtype' => '题型',
    'course' => '课程名',
    'section' => '章名',
    'sections' => '节名',
    'diff' => '难度',
    'usepermiss' => '使用权限',
    'name' => '试题名生成的试题简介',
    'questiontext' => '题目',
    'generalfeedback' => '试题解析',
    'auth' => '添加者',
    'createtime' => '添加时间 Y-m-d',
    'option' => [
        [
            'id' => '子id',
            'qtype' => '题型-选择',
            'name' => '问题',
            'answer' => [
                [
                    'id' => '答案id',
                    'name' => '答案',
                    'fraction' => '正确答案标记',
                    'tab' => '选项标记',
                    'imgs' => '图片id'
                ],
                [
                    'id' => '答案id',
                    'name' => '答案',
                    'fraction' => '正确答案标记',
                    'tab' => '选项标记',
                    'imgs' => '图片id'
                ]
            ],
            'imgs' => [
                '图片id1', '图片id2'
            ]
        ],
        [
            'id' => '子id',
            'qtype' => '题型-判断',
            'name' => '问题',
            'imgs' => '图片id',
            'answer' => [
                'id' => '答案id',
                'fraction' => 0:对|1：错
            ],
        ],
        [
            'id' => '子id'，
            'qtype' => '题型-填空',
            'name' => '问题',
            'imgs' => '图片id',
            'answer' => [
                '答案id' => '答案1',
                '答案id' => '答案2',
                '答案id' => '答案3'
            ],
        ],
        [
            'id' => '子id'
            'qtype' => '题型-简答',
            'questiontext' => '问题',
            'imgs' => '图片id',
            'answer' => [
                '答案id' => '答案'
            ]
        ]
    ],
    'imgs' => [
        '图片id1', '图片id2'
    ],
    'check' => '审核状态',
    'check_msg' => '当审核状态未通过时，该字段值未question_check表的text字段的值；否则无该字段'

]
---------------------------查询试题（试题列表）----------------------------------exam::Question::questionList

//试题列表（请求数据）
[
    'course' => '课程id',
    'classroom' => '课堂id,在课堂下查询试题的时候使用，其它时候可为空',//课堂会用
    'section' => '课程章id（可不传，默认为所有章）',//课堂会用
    'sections' => '课程节id（可不传，默认为所有节）',//课堂会用
    'qtype' => '题型（可不传，默认为所有题型）',//课堂会用
    'kwords' => '题目关键字查询（可不传）',//课堂会用
    'check' => '审核状态（可不传，默认为可用状态的试题）',
    'diff' => '难度(可不传，默认为所有难度类型)',//课堂会用
    'usepermise' => '试题使用权限（可不传，默认为所有，0：通用，1：仅个人，2：仅考试；如果为考试请求试题列表，请传值为(0,2)'）,
    'sonnum' => '子题个数；针对填空题型的填空数，匹配、综合、阅读理解的子题数，其它题型无此搜索条件',
    'page' => '页数(可不传，使用默认)',
    'rows' => '每页数据条数（可不传，使用默认）'
]

//试题列表（返回数据）
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ],
    'data' => [
        [//选择
            'id' => '',
            'qtype' => '题型',
         /*   'course' => '课程id',*/
            'diff' => '难度',
            'usepermiss' => '使用权限',
            'name' => '试题名生成的试题简介',
            'questiontext' => '题目',
            'generalfeedback' => '试题解析',
            'auth' => '添加者',
            'createtime' => '添加时间 Y-m-d'，
            'answer' => [//答案按tab字段排序
                [
                    'id' => '',
                    'name' => '答案',
                    'fraction' => '正确答案标记',
                    'tab' => '选项标记',
                    'imgs' => '图片id'
                ],
                [
                    'id' => '',
                    'name' => '答案',
                    'fraction' => '100',//100
                    'tab' => '选项标记',
                    'imgs' => '图片id'
                ],
                ...
            ],
            'imgs' => [
                '图片id1', '图片id2'
            ],
            'check' => '审核状态'
        ],
        [//填空
            'id' => '题id',
            'qtype' => '题型',
        /*    'course' => '课程id',*/
            'section' => '章名',
            'sections' => '节名',
            'diff' => '难度',
            'usepermiss' => '使用权限',
            'name' => '试题名生成的试题简介',
            'questiontext' => '题目',
            'generalfeedback' => '试题解析',
            'auth' => '添加者',
            'createtime' => '添加时间 Y-m-d',
            'answer' => ['答案1', '答案2', '答案3'],
            'imgs' => [
                '图片id1', '图片id2'
            ],
            'check' => '审核状态'
        ],
        [//判断-返回数据
            'id' => '题id',
            'qtype' => '题型',
          /*  'course' => '课程id',*/
            'section' => '章名',
            'sections' => '节名',
            'diff' => '难度',
            'usepermiss' => '使用权限',
            'name' => '试题名生成的试题简介',
            'questiontext' => '题目',
            'generalfeedback' => '试题解析',
            'auth' => '添加者',
            'createtime' => '添加时间 Y-m-d',
            'answer' => [
                [
                    'id' => '答案id',
                    'answer' => '',
                    'fraction' => ''
                ],
                ...

            ],
            'imgs' => [
                '图片id1', '图片id2'
            ],
            'check' => '审核状态'
        ],
        [//匹配-返回数据
            'id' => '题id'，
            'qtype' => '题型',
          /*  'course' => '课程id',*/
            'section' => '章名',
            'sections' => '节名',
            'diff' => '难度',
            'usepermiss' => '使用权限',
            'name' => '试题名生成的试题简介',
            'questiontext' => '题目',
            'generalfeedback' => '试题解析',
            'auth' => '添加者',
            'createtime' => '添加时间 Y-m-d',
            'option' => [
                [
                    'id' => '子id',
                    'questiontext' => '题目',
                    'answer' => '答案'
                ],
                [
                    'id' => '子id',
                    'questiontext' => '题目',
                    'answer' => '答案'
                ],
                ...
            ],
            'imgs' => [
                '图片id1', '图片id2'
            ],
            'check' => '审核状态'
        ],
        [//简答-返回数据
            'id' => '题id',
            'qtype' => '题型',
       /*     'course' => '课程id',*/
            'section' => '章名',
            'sections' => '节名',
            'diff' => '难度',
            'usepermiss' => '使用权限',
            'name' => '试题名生成的试题简介',
            'questiontext' => '题目',
            'answer' => '参考答案',
            'generalfeedback' => '试题解析',
            'auth' => '添加者',
            'createtime' => '添加时间 Y-m-d',
            'imgs' => [
                '图片id1', '图片id2'
            ],
            'check' => '审核状态'
        ],
        [//综合-返回数据
            'id' => '题id'，
            'qtype' => '题型',
          /*  'course' => '课程id',*/
            'section' => '章名',
            'sections' => '节名',
            'diff' => '难度',
            'usepermiss' => '使用权限',
            'name' => '试题名生成的试题简介',
            'questiontext' => '题目',
            'generalfeedback' => '试题解析',
            'auth' => '添加者',
            'createtime' => '添加时间 Y-m-d',
            'option' => [
                [
                    'id' => '子id',
                    'questiontext' => '题目',
                    'answer' => '参考答案'
                ],
                [
                    'id' => '子id',
                    'questiontext' => '题目',
                    'answer' => '参考答案'
                ],
                ...
            ],
            'imgs' => [
                '图片id1', '图片id2'
            ],
            'check' => '审核状态'
        ],
        [//阅读理解-返回数据
            'id' => '题id',
            'qtype' => '题型',
        /*    'course' => '课程id',*/
            'section' => '章名',
            'sections' => '节名',
            'diff' => '难度',
            'usepermiss' => '使用权限',
            'name' => '试题名生成的试题简介',
            'questiontext' => '题目',
            'generalfeedback' => '试题解析',
            'auth' => '添加者',
            'createtime' => '添加时间 Y-m-d',
            'option' => [
                [//选择
                    'id' => '子id',
                    'qtype' => '题型',
                    'questiontext' => '问题',
                    'answer' => [
                        [
                            'id' => '答案id',
                            'name' => '答案',
                            'fraction' => '正确答案标记',
                            'tab' => '选项标记',
                            'imgs' => '图片id'
                        ],
                        [
                            'id' => '答案id',
                            'name' => '答案',
                            'fraction' => '正确答案标记',
                            'tab' => '选项标记',
                            'imgs' => '图片id'
                        ]
                    ],
                    'imgs' => [
                        '图片id1', '图片id2'
                    ],
                    'check' => '审核状态'
                ],
                [//判断
                    'id' => '子id',
                    'qtype' => '题型',
                    'questiontext' => '问题',
                    'imgs' => '图片id',
                    'answer' => [
                        [
                            'id' => '答案id',
                            'answer' => '',
                            'fraction' => ''
                        ],
                        ...

                    ],
                ],
                [//填空
                    'id' => '子id'，
                    'qtype' => '题型',
                    'questiontext' => '问题',
                    'imgs' => '图片id',
                    'answer' => [
                        '答案id' => '答案1',
                        '答案id' => '答案2',
                        '答案id' => '答案3'
                    ],
                ],
                [
                    'id' => '子id',
                    'qtype' => '题型-简答',
                    'questiontext' => '问题',
                    'imgs' => '图片id',
                    'answer' => '答案'
                ]
            ],
            'imgs' => [
                '图片id1', '图片id2'
            ],
            'check' => '审核状态'
        ]
        ...
    ]
]
------------------------------查询试题数量------------------------------------exam::Question::getQuestionNum
//(请求数据)
[
    'id' => '课程或课堂id，不能为空 （没有值时，默认登陆用户所有课程下所有有效试题，后续扩展，现阶段，该值不能为空）',
]
//(返回数据)
[
    'number' => 总题数,
    '试题审核状态' => [
        'number' => 总个数,
        '题型' => [
            '难度1' => 个数,
            '难度2' => 个数
        ]
    ],
    ....
]

------------------------------试题审核------------------------------------exam::Question::checkQuestion
//(请求数据)
[
    'id' => '题id',
    'status' => '1：审核通过|2：审核不通过',
    'msg' => 'status为2时，表示审核不通过原因'
]
------------------------------删除试题------------------------------------exam::Question::delQuestion
//(请求数据)
[
    'id' => '题id'
]
//(返回数据)
返回true或false

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课堂试题管理----------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------

------------------------------查看试题列表（调用课堂的试题列表的方法）----exam::Question::classroomList
//（请求数据）
使用课程下试题列表的请求数据

//（返回数据）
使用课程下试题列表的数据格式

------------------------------试题报错------------------------------------exam::Question::questionError
//(请求数据)
[
    'id' => '试题id'
]
//（返回数据）
返回成功或失败原因
------------------------查看试题详情（调用课堂的试题详情的方法）----------exam::Question::classroomDetail
//某一个题
//（请求数据）
[
    'id' => '题id'
]
//（返回数据-选择）
使用课程下试题列表的数据格式

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------课堂试卷管理----------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------

------------------------------创建试卷------------------------------------exam::Quiz::createQuiz
//(请求数据)
[
    'pid' => '试卷父id,可能为空',
    'classroom' => '课堂id',
    'section' => ['章id1', '章id2', '章id3'],
    'sections' => ['节id1', '节id2', '节id3'],
    'name' => '试卷名',
    'intro' => '试卷说明',
    'examtype' => '试卷用途',
    'timeopen' => '试卷开始时间（Y-m-d H:i:s）',
    'timeclose' => '试卷结束时间（Y-m-d H:i:s）',
    'timelimit' => '试卷考试时间，单位：分钟（存入数据库时，单位为秒）',
    'grade' => '总分',
    'preferredbehaviour' => '学生查看答卷的时间（0：考试结束后|1：始终不显示  默认为1）',
    'grademethod' => '评分办法（1：最高分|2：平均分|3：第一次答题|4：最后一次答题   默认为1）',
    'attempts' => '允许答题次数（0：无限制）',
    'shufflequestions' => '0：自动选题|1：手动选题   默认为1',
    'questions' => [//'shufflequestions为0时，为1时，此为空'
        '题型代码' => [//单选，多选，判断，简答，
            'qtype' => '题型',
            'section' => ['章id1', '章id2', '章id3'],
            'sections' => ['节id1', '节id2', '节id3'],
            'gross_score' => '该题总分',
            'conf' => [
                ['diff' => '难度1', 'num' => '个数'],
                ['diff' => '难度2', 'num' => '个数']
            ]
        ],//一个题型一个数组
        '题型代码' => [//填空，匹配，综合，阅读理解
            'qtype' => '题型',
            'section' => ['章id1', '章id2', '章id3'],
            'sections' => ['节id1', '节id2', '节id3'],
            'score' => '每子题分值或填空题每个空的分值',
            'number' => '子题数',
            'gross_score' => '该题总分',
            'conf' => [
                ['diff' => '难度1', 'num' => '个数'],
                ['diff' => '难度2', 'num' => '个数']
            ]
        ],//一个题型一个
    ]
]
//(返回数据-成功)
[
    'quiz' => '试卷id'
]
//(返回数据-失败)
[
    '失败原因'
]

-------------------------试卷表questions字段数组格式--------------
[
    '题型1' => [
        'score' => 总分值,
        '难度1' => 题数量,
        '难度2' => 题数量,
    ],
    '题型2' => [
        'score' => 总分值,
        '难度1' => 题数量,
        '难度2' => 题数量,
    ]
]

------------------------------创建试卷，编辑试卷（给试卷手动添加题，编辑和创建）------------------------------------exam::Quiz::handAddQuestion
//（请求数据）
[
//选择，判断，简答
    'quiz' => '试卷id',
    'qtype' => '题型',
    'score' => '每题分值',
    'questions' => [ 'id1', 'id2' ]
//填空，匹配，综合，阅读理解
    'quiz' => '试卷id',
    'qtype' => '题型',
    'questions' => [
        [
            'id' => '题id1'
            'score' => '每子题分值或填空题每个空的分值',
            'gross_score' => '总分'
        ],
        [
            'id' => '题id1'
            'score' => '每子题分值或填空题每个空的分值',
            'gross_score' => '总分'
        ]
    ]
]
//(返回数据-具体开发的时候研讨)
[

]
------------------------------编辑试卷（手动删除试卷下的题）------------------------------------exam::Quiz::delQuestion
//（请求数据）
[
    'quiz' => '试卷id',
    'questions' => ['id', 'id']
]
//(返回数据-具体开发的时候研讨)
[
]

------------------------------创建试卷（根据配置给试卷自动添加题）------------------------------------exam::Quiz::autoAddQuestion
根据创建试卷的请求数据的questions的值，完成试题添加

------------------------------编辑试卷(试卷开始时间已到，不可编辑)------------------------------------exam::Quiz::editQuiz
//（请求数据）
[
    'id' => '试卷id',
    'section' => ['章id1', '章id2', '章id3'],
    'sections' => ['节id1', '节id2', '节id3'],
    'examtype' => '0 测试 | 1 考试',
    'timeopen' => '试卷开始时间（时间戳或 Y-m-d H:i:s）',
    'timeclose' => '试卷结束时间（时间戳或 Y-m-d H:i:s）',
    'timelimit' => '试卷考试时间，单位：分钟（存入数据库时，单位为秒）',
    'preferredbehaviour' => '学生查看答卷的时间（0：考试结束后|1：始终不显示  默认为1）',
    'grademethod' => '评分办法（1：最高分|2：平均分|3：第一次答题|4：最后一次答题   默认为1）',
    'attempts' => '允许答题次数（0：无限制）',
    'shufflequestions' => '0：自动选题|1：手动选题',
    'questions' => [//'shufflequestions为0时，为1时，此为空'
        '题型代码' => [//单选，多选，判断，简答，
            'qtype' => '题型',
            'section' => ['章id1', '章id2', '章id3'],
            'sections' => ['节id1', '节id2', '节id3'],
            'score' => '单选，多选，判断，简答题型为空',
            'gross_score' => '该题总分',
            'conf' => [
                ['diff' => '难度1', 'num' => '个数'],
                ['diff' => '难度2', 'num' => '个数']
            ]
        ],//一个题型一个数组
        '题型代码' => [//填空，匹配，综合，阅读理解
            'qtype' => '题型',
            'section' => ['章id1', '章id2', '章id3'],
            'sections' => ['节id1', '节id2', '节id3'],
            'score' => '每子题分值或填空题每个空的分值',
            'gross_score' => '该题总分',
            'conf' => [
                ['diff' => '难度1', 'num' => '个数'],
                ['diff' => '难度2', 'num' => '个数']
            ]
        ],//一个题型一个
    ],
    'grade' => '总分'
]
//(返回数据)
返回true或false
------------------------------查看试卷详情（试卷属性，不包含题）------------------------------------exam::Quiz::quizDetail
//（请求数据）
[
    'id' => '试卷id'
]
//（返回数据）
[
    'id' => '试卷id',
    'sectoin' => ['章id1', '章id2'],
    'sections' => ['节id1', '节id2'],
    'sectionname' => ['章名1', '章名2'],
    'sectionsname' => ['节名1', '节名2'],
    'examtype' => '试卷类型',
    'name' => '试卷名字',
    'intro' => '试卷说明',
    'timeopen' => '试卷开始时间 (Y-m-d H:i)',
    'timeclose' => '试卷结束时间 (Y-m-d H:i)',
    'timelimit' => '试卷考试时间 单位：分',
    'preferredbehaviour' => '学生查看答卷的时间（0：考试结束后|1：始终不显示）',
    'grademethod' => '评分办法',
    'attempts' => '允许答题次数（0：无限制）',
    'shufflequestions' => '选题方式  0：自动选题|1：手动选题',
    'grade' => '试卷总分',
    'timecreated' => '试卷创建时间 (Y-m-d H:i)',
    'timemodified' => '试卷最近修改时间 (Y-m-d H:i)',
    'createdbyid' => '试卷创建者',
    'uploadbyid' => '试卷最近修改者'
]
------------------------------根据试卷id得到试卷下的题列表------------------------------------exam::Quiz::getQuizQuestionList
//(请求数据)
[
    'quiz' => '试卷id'
]
//(返回数据)
[
    [//选择题
        'qtype' => '题型',
        'id' => '题id',
        'name' => '试题名生成的试题简介',
        'questiontext' => '试题名',
        'seq' => '题序',
        'imgs' => ['id1', 'id2'],
        'score' => '该题分值',
        'answer' => [
            [
                'qtype' => '题型',
                'answer' => '答案',
                'fraction' => '正确答案标记',
                'tab' => '答案选项符号',
                'img' => 'id'
            ],
            ...
        ]
    ],
    [//填空
        'qtype' => '题型',
        'id' => '题id',
        'name' => '试题名生成的试题简介',
        'questiontext' => '试题名',
        'seq' => '题序',
        'imgs' => ['id1', 'id2'],
        'score' => '该题分值',
        'answer' => [
            '答案1',
            '答案2',
            '答案3'
        ],
    ],
    [//判断
        'qtype' => '题型',
        'id' => '题id',
        'name' => '试题名生成的试题简介',
        'questiontext' => '试题名',
        'seq' => '题序',
        'imgs' => ['id1', 'id2'],
        'score' => '该题分值',
        'answer' => [
            ['answer' => '', 'fraction' => ''],
            ....
        ]
    ],
    [//匹配
        'qtype' => '题型',
        'id' => '题id',
        'name' => '试题名生成的试题简介',
        'questiontext' => '试题名',
        'seq' => '题序',
        'imgs' => ['id1', 'id2'],
        'score' => '该题分值',
        'option' => [
            [
                'id' => '子id',
                'name' => '问题',
                'answer' => '答案'
            ],
            [
                'id' => '子id',
                'name' => '问题',
                'answer' => '答案'
            ],
            ...
        ]
    ],
    [//简答
        'qtype' => '题型',
        'id' => '题id',
        'name' => '试题名生成的试题简介',
        'questiontext' => '试题名',
        'seq' => '题序',
        'imgs' => ['id1', 'id2'],
        'score' => '该题分值',
        'answer' => '参考答案',
    ],
    [//综合
        'qtype' => '题型',
        'id' => '题id',
        'name' => '试题名生成的试题简介',
        'questiontext' => '试题名',
        'seq' => '题序',
        'imgs' => ['id1', 'id2'],
        'score' => '该题分值',
        'option' => [
            [
                'id' => '子id',
                'name' => '问题1',
                'answer' => '参考答案'
            ],
            [
                'id' => '子id',
                'name' => '问题2',
                'answer' => '参考答案'
            ],
            ...
        ],
    ],
    [//阅读理解
        'qtype' => '题型',
        'id' => '题id',
        'name' => '试题名生成的试题简介',
        'questiontext' => '试题名',
        'seq' => '题序',
        'imgs' => ['id1', 'id2'],
        'score' => '该题分值',
        'option' => [
            [
                'id' => '子id',
                'qtype' => '题型-选择',
                'name' => '问题',
                'answer' => [
                    [
                        'id' => '答案id',
                        'name' => '答案',
                        'fraction' => '正确答案标记',
                        'tab' => '选项标记',
                        'imgs' => '图片id'
                    ],
                    [
                        'id' => '答案id',
                        'name' => '答案',
                        'fraction' => '正确答案标记',
                        'tab' => '选项标记',
                        'imgs' => '图片id'
                    ]
                ],
                'imgs' => [
                    '图片id1', '图片id2'
                ]
            ],
            [
                'id' => '子id',
                'qtype' => '题型-判断',
                'name' => '问题',
                'answer' => [
                    'id' => '答案id',
                    'fraction' => 0:对|1：错
                ],
            ],
            [
                'id' => '子id'，
                'qtype' => '题型-填空',
                'name' => '问题',
                'answer' => [
                    '答案id' => '答案1',
                    '答案id' => '答案2',
                    '答案id' => '答案3'
                ],
            ],
            [
                'id' => '子id',
                'qtype' => '题型-简答',
                'name' => '问题',
                'answer' => [
                    '答案id' => '答案'
                ]
            ]
        ]
    ]

]

------------------------------试卷列表（实现条件搜索）------------------------------------exam::Quiz::getQuizList
//（请求数据）
[
    'classroom' => '课堂id,不为空',
    'keywords' => '试卷关键字搜索（可不传）',
    'examtype' => '试卷用途',
    'check' => '没有值时，默认为查询所有',
    'page' => '页数，默认为1',
    'rows' => '每页数据条数，默认为15'
]
//(返回数据)
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ]
    'data' => [
        [
            'id' => '试卷id',
            'name' => '试卷名',
            'classroom' => '课堂名',
            'state' => '试卷状态',
            'state_code' => '试卷状态代码',
            'timecreated' => '创建时间  格式：(Y-m-d H:i)',
            'disparktime' => '试卷开放时间  格式：(Y-m-d H:i 开始 Y-m-d H:i截止)',
            'examtype' => '试卷用途',
            'auth' => '试卷创建者',
            'timelimit' => '试卷考试时长 格式：**分**秒',
            'grade' => '总分'
        ],
        ...
    ]
]
/*
------------------------------修改试卷题  手动配置试卷题管理------------------------------------exam::Quiz::upQuizQuestion
//(请求数据)
[
    'quiz' => '试卷id',
    'questions' => [
        ['qtype' => '题型1', 'id' => '题id', 'score' => '某一个题的分值'],
        ['qtype' => '题型1', 'id' => '题id', 'score' => '某一个题的分值']
    ]
]
//(返回数据)
后期讨论
*/
------------------------------删除试卷------------------------------------exam::Quiz::delQuiz
//（请求数据）
[
    'id' => '试卷id'
]
//(返回数据)
返回true或false

/*------------------------------老师发布试卷------------------------------------exam::Quiz::publishQuiz
//(请求数据)
[
    'id' => '试卷id'
]
//（返回数据）
返回true或false
*/
/*------------------------------试卷列表（学生查看，实现条件搜索---------------------------------exam::Quiz::selQuizList
//(请求数据)
[
    'id' => '课堂id（id未空时，根据登录用户得到学生所有的课堂，再根据课堂获取所有的试卷）',
    'timelimit' => '',
    'page' => '',
    'rows' => ''
]
//(返回数据)
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ],
    'data' => [
        'id' => '试卷id',
        'name' => '试卷名',
        'classroom' => '课堂名',
        'timecreated' => '创建试卷  格式：(Y-m-d H:i)',
        'disparktime' => '试卷开放时间  格式：(Y-m-d H:i 开始 Y-m-d H:i截止)',
        'examtype' => '试卷用途'
    ]
]*/
------------------------------试卷拷贝---------------------------------exam::Quiz::copyOut
/*//(请求数据)
[
    'id' => '试卷id'
]
//（返回数据）
[
    'id' => '试卷id',
    'name' => '试卷名',
    'classroomid' => '课堂id',
    'sections' => ['section' => ['章id', '章id'], 'sections' => '节id', '节id'],
    'intro' => '试卷说明',
    'examtype' => '试卷类型',
    'timeopen' => '试卷开始时间 (Y-m-d H:i)',
    'timeclose' => '试卷开始时间 (Y-m-d H:i)',
    'timelimit' => '试卷考试时间 (??时??分??秒)',
    'preferredbehaviour' => '学生查看答卷的时间（0：考试结束后|1：始终不显示）',
    'grademethod' => '评分办法',
    'attempts' => '允许答题次数（0：无限制）',
    'shufflequestions' => '选题方式  0：自动选题|1：手动选题',
    'grade' => '试卷总分',
]*/
------------------------------试卷申请审核---------------------------------exam::Quiz::applyAudit
//（请求数据）
[
    'id' => '试卷id'
]
//(返回数据)
返回成功或失败原因
------------------------------试卷审核---------------------------------exam::Quiz::audit
//（请求数据）
[
    'id' => '试卷id',
    'status' => '审核通过状态  0：通过  1：未通过',
    'msg' => '未通过原因'
]
//(返回数据)
返回成功或失败原因

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------试卷场次管理----------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------

------------------------------创建考试场次  ------------------------------------exam::project::createProject
//（请求数据）
[
    'name' => '场次名称',
    'message' => '场次描述',
    'strttime' => '开始时间 （Y-m-d H:i）',
    'endtime' => '结束时间 （Y-md H:i）',
    'quiz' => '试卷id',
 //   'attempts' => '允许答题次数（为1）'
]
//（返回数据）
返回成功或失败原因
------------------------------编辑试卷考试场次------------------------------------exam::project::editProject
//（请求数据）
[
    'name' => '场次名称',
    'message' => '场次描述',
    'starttime' => '开始时间 （Y-m-d H:i）',
    'endtime' => '结束时间 （Y-m-d H:i）',
    'id' => '场次id',
  //  'attempts' => '允许答题次数（0：无限制）',
  //  'quiz' => '试卷id',
  //  'quiz_name' => '试卷名'
]
//（返回数据）
返回成功或失败原因
------------------------------删除试卷考试场次------------------------------------exam::project::delProject
//(请求数据)
[
    'id' => '场次id'
]
//（返回数据）
返回成功或失败原因
------------------------------查看试卷考试场次详情------------------------------------exam::project::details
//（请求数据）
[
    'id' => '场次id'
]
//（返回数据）
[
    'id' => '场次id',
    'name' => '场次名称',
    'message' => '场次描述',
    'starttime' => '开始时间 Y/m/d H:i',
    'endtime' => '结束时间 Y/m/d H:i',
    'limittime' => '考试时长 单位：分',
    'check' => '1：考试未开始  2：考试中  3：考试结束',
    'attempts' => '允许答题次数（0：无限制）',
    'quiz' => '试卷id',
    'quiz_name' => '试卷名',
    'auth' => '创建者名',
    'timecreated' => '创建时间 Y/m/d H:i',
    'sections' => [
        'section' => ['章名1', '章名2'],
        'sections' => ['节名1', '节名2']
    ]
]
------------------------------查看试卷考试场次列表(可实现搜索)------------------------------------exam::project::index
//（请求数据）
[//可多个条件联合搜索，默认搜索为当前登录用户所能查看的所有考试场次
    'name' => '考试场次名关键字',
    'starttime' => '开始时间 Y-m-d H:i:s',
    'endtime' => '结束时间 Y-m-d H:i:s',
    'limittime' => '考试时长',
    'classroom' => '课堂id',
    'sections' => '课堂章节id',
    'page' => '页码， 默认为1',
    'rows' => '条数，默认为配置'
]
//(返回数据)
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ],
    'data' => [
        [
            'id' => '场次id',
            'name' => '场次名',
            'starttime' => '开始时间 Y-m-d H:i',
            'endtime' => '结束时间 Y-m-d H:i',
            'check' => '考试状态'
        ],
        ...
    ]
]

----------------------------------场次审核---------exan::project::audit
//请求数据
[
    'id' => '场次id',
    'status' => '1：通过|2：不通过',
    'msg' => '通过为空，不通过时为不通过的描述信息'
]
//返回数据
返回成功或失败原因


--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------考试管理----------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------

------------------------------开始考试(创建测试卷子，返回卷子题信息)------------------------------------exam::exam::startTest
//(请求数据)
[
    'id' => '试卷id'
]
//（返回数据）
同下创建考试试卷返回一致

------------------------------开始考试(创建考试卷子，返回卷子题信息)------------------------------------exam::exam::start
//(请求数据)
[
    'id' => '场次id'
]
//(返回数据--返回保存实际卷子下所有题信息)
[
    '题型-选择' => [//单选,多选
        [
            'id' => 'exam_classroom_question_attempt_step表的id',
            'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
            'score' => '题分数,exam_classroom_question_attempt_step表',
            'qtype' => '题型，exam_question表',
            'questiontext' => '试题名，exam_question表',
            'img' => '图片id，exam_question表',
            'option' => [
                [
                    'id' => '答案id,exam_answer表id',
                    'answer' => '答案，exam_answer表',
                    'tab' => '答案选项符号，exam_answer表',
                    'img' => '图片id，exam_answer表',
                ],
                [
                    'id' => '答案id,exam_answer表id',
                    'answer' => '答案，exam_answer表',
                    'tab' => '答案选项符号，exam_answer表',
                    'img' => '图片id，exam_answer表',
                ]
            ]
        ],
        ....
    ],
    '题型-判断' => [//判断
        [
            'id' => 'exam_classroom_question_attempt_step表的id',
            'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
            'score' => '题分数,exam_classroom_question_attempt_step表',
            'qtype' => '题型，exam_question表',
            'questiontext' => '试题名，exam_question表',
            'img' => '图片id，exam_question表',
            'option' => [
                'id1,exam_answer表id', 'id2,exam_answer表id'
            ]
        ],
        ...
    ],
    '题型-填空,简答' => [//填空,简答
        [
            'id' => 'exam_classroom_question_attempt_step表的id',
            'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
            'score' => '题分数,exam_classroom_question_attempt_step表',
            'qtype' => '题型，exam_question表',
            'questiontext' => '试题名，exam_question表',
            'img' => '图片id，exam_question表',
        ],
        ...
    ],
    '题型-匹配' => [//匹配
        [
            'id' => 'exam_classroom_question_attempt_step表的id',
            'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
            'score' => '题分数,exam_classroom_question_attempt_step表',
            'qtype' => '题型，exam_question表',
            'questiontext' => '试题名，exam_question表',
            'img' => '图片id，exam_question表',
            'option' => [
                'question' => [
                    'id,exam_classroom_question_attempt_step表id' => '问题1，exam_question表',
                    'id,exam_classroom_question_attempt_step表id' => '问题2，exam_question表'
                ],
                'answer' => [
                    'id,answer表id' => '答案1，answer表',
                    'id，answer表id' => '答案2，answer表'
                ]
            ]
        ],
        ...
    ],
    '题型-综合' => [//综合
        [
            'id' => 'exam_classroom_question_attempt_step表的id',
            'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
            'score' => '题分数,exam_classroom_question_attempt_step表',
            'qtype' => '题型，exam_question表',
            'questiontext' => '试题名，exam_question表',
            'img' => '图片id，exam_question表',
            'option' => [
                'question' => [
                    'id,exam_classroom_question_attempt_step表id' => '问题1，exam_question表',
                    'id,exam_classroom_question_attempt_step表id' => '问题2，exam_question表'
                ]
            ]
        ],
        ...
    ],
    '题型-阅读理解' => [//阅读理解
        [
            'id' => 'exam_classroom_question_attempt_step表的id',
            'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
            'score' => '题分数,exam_classroom_question_attempt_step表',
            'qtype' => '题型，exam_question表',
            'questiontext' => '试题名，exam_question表',
            'img' => '图片id，exam_question表',
            'option' => [
                [//单选,多选
                    'id' => 'exam_classroom_question_attempt_step表id',
                    'qtype' => '题型，exam_question表',
                    'questiontext' => '试题名，exam_question表',
                    'img' => '图片id，exam_question表',
                    'option' => [
                        [
                            'id' => 'answer表id',
                            'answer' => '答案，exam_answer表',
                            'tab' => '答案选项符号，exam_answer表',
                            'img' => '图片id，exam_answer表',
                        ],
                        [
                            'id' => 'answer表id',
                            'answer' => '答案，exam_answer表',
                            'tab' => '答案选项符号，exam_answer表',
                            'img' => '图片id，exam_answer表',
                        ]
                    ]
                ],
                [//判断
                    'id' => 'exam_classroom_question_attempt_step表id',
                    'qtype' => '题型，exam_question表',
                    'questiontext' => '试题名，exam_question表',
                ],
                [//填空
                    'id' => 'exam_classroom_question_attempt_step表id',
                    'qtype' => '题型，exam_question表',
                    'questiontext' => '试题名，exam_question表',
                ],
                [//简答
                    'id' => 'exam_classroom_question_attempt_step表id',
                    'qtype' => '题型，exam_question表',
                    'questiontext' => '试题名，exam_question表',
                ]
            ]
        ],
        ...
    ]
]
------------------------------js保存答案------------------------------------exam::exam::saveAnswer
//(请求数据)
[//选择
    'attempts' => 'id,exam_classroom_quiz_attempts表id',
    'qtype' => '题型',
    'id' => '题id，exam_classroom_question_attempt_step表id',
    'answer' => ['选项id1，exam_answer表id', '选项id2，exam_answer表id'],
]
[//填空
    'attempts' => 'id,exam_classroom_quiz_attempts表id',
    'qtype' => '题型',
    'id' => '题id，exam_classroom_question_attempt_step表id',
    'answer' => ['答案1', '答案2']
]
[//判断
    'attempts' => 'id,exam_classroom_quiz_attempts表id',
    'qtype' => '题型',
    'id' => '题id，exam_classroom_question_attempt_step表id',
    'answer' => '选项id,exam_answer表id'
]
[//匹配
    'attempts' => 'id,exam_classroom_quiz_attempts表id',
    'qtype' => '题型',
    'pid' => '题父id，没有时为空 exam_classroom_question_attempt_step表id',
    'id' => '题id，exam_classroom_question_attempt_step表id',
    'answer' => '答案id，exam_answer表id',
]
[//简答-综合
    'attempts' => 'id,exam_classroom_quiz_attempts表id',
    'qtype' => '题型',
    'pid' => '题父id，没有时为空 exam_classroom_question_attempt_step表id(简答题没有，综合题有)',
    'id' => '题id，exam_classroom_question_attempt_step表id',
    'answer' => '答案'
]
[//阅读理解-其下各题型与上各题型相同
    'attempts' => 'id,exam_classroom_quiz_attempts表id',
    'qtype' => '题型,阅读理解',
    'pid' => '题id，exam_classroom_question_attempt_step表id',
    'option' => [//和上各题型一致
        'qtype' => '子题型',
        ...
    ]
]
//(返回数据)
[
    'status' => 0|1,//0,保存成功   1，保存失败
    'msg' => '保存失败原因',
    'surplus' => '考试剩余时间，单位：秒',
]
------------------------------考试结束（提交答卷）---------------------------exam::exam::subAttempt
//(请求数据)
[
    'id' => '实际试卷id，exam_classroom_quiz_attempts表id',
    'answer' => [
        '题型-选择' => [
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'answer' => ['选项id1，exam_answer表id', '选项id2，exam_answer表id'],
            ],
            ...
        ],
        '题型-填空' => [
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'answer' => ['答案1', '答案2'],
            ],
            ...
        ],
        '题型-判断' => [
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'answer' => '选项id1，exam_answer表id',
            ],
            ...
        ],
        '题型-匹配' => [
            [
                [
                    'id' => 'id-题id，exam_classroom_question_attempt_step表id',
                    'answer' => '选项id，exam_answer表id'
                ],
                ...
            ],
            ...
        ],
        '题型-简答' => [
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'answer' => '答案'
            ],
            ...
        ],
        '题型-综合' => [//没有算分的格式
            [
                'id' => 'id-题id，exam_classroom_question_attempt_step表id',
                'answer' => '答案'
            ],
            ...
        ],
        '题型-阅读理解' => [
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'qtype' => '题型-选择',
                'answer' => ['选项id1，exam_answer表id', '选项id2，exam_answer表id']
            ],
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'qtype' => '题型-判断',
                'answer' => 'id,exam_answer表id'
            ],
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'qtype' => '题型-填空',
                'answer' => ['答案', '答案']
            ],
            [
                'id' => '题id，exam_classroom_question_attempt_step表id',
                'qtype' => '题型-简答',
                'answer' => '答案'
            ]
        ]
    ]
]
//(返回数据)
[
    'status' => 0|1,//0,保存成功   1，保存失败
    'msg' => '保存失败原因',
    'surplus' => '考试剩余时间，单位：秒',
]

--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------答卷管理----------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------
--------------------------------------------------------------------------

------------------------------答卷列表------------------------------------exam::answerSheet::index
//(请求数据)
[
    'name' => '场次名，可不传',
    'type' => '试卷类型，可不传,默认为练习和考试答卷',
    'classroom' => '课堂id，可不传'
    'page' => '页数，默认为1',
    'rows' => '每页数据条数，没传时，使用配置',
]
//（返回数据）
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ],
    'data' => [
        [
            'id' => '试卷场次id，exam_classroom_project表id',
            'name' => '试卷名',
            'shortname' => '课堂简称',
            'fullname' => '课堂全名',
            'status' => '试卷状态',
            'type' => '试卷类别',
            'timeopen' => '试卷开放时间（Y/m/d H:i-Y/m/d H:i）',
            'joinnum' => '参与考试人数',
            'alreadysum' => '已提交人数'
        ],
        [
            'id' => '试卷场次id，exam_classroom_project表id',
            'name' => '试卷名',
            'shortname' => '课堂简称',
            'fullname' => '课堂全名',
            'status' => '试卷状态',
            'type' => '试卷类别',
            'timeopen' => '试卷开放时间（Y/m/d H:i-Y/m/d H:i）',
            'joinnum' => '参与考试人数',
            'alreadysum' => '已提交人数'
        ]
    ]
]

------------------------------答卷详情------------------------------------exam::answerSheet::details
//(请求数据)
[
    'attempt' => '答卷id',
    'classroom' => '课堂id'
]
//（返回数据）
[
    'id' => '答卷id',
    'username' => '考试人名',
    'number' => '学生编号',
    'attempt' => '答卷序号',
    'sumgrades' => '试卷得分',
    'timestart' => '试卷开始考试时间  Y/m/d H:i:s',
    'timefinish' => '试卷结束考试时间 Y/m/d H:i:s',
    'usedtime' => '试卷考试使用时间 单位：分',
    'question' => [
        '题型-选择' => [
            'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [
                'id' => 'exam_classroom_question_attempt_step表的id',
                'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
                'score' => '题分数,exam_classroom_question_attempt_step表',
                'grade' => '该题得分, exam_classroom_question_attempt_step表grade字段',
                'qtype' => '题型，exam_question表',
                'questiontext' => '试题名，exam_question表',
                'img' => '图片id，exam_question表',
                'generalfeedback' => '试题解析,exam_question表',
                'remarks' => '老师批语',
                'option' => [//选择
                    'number,exam_classroom_question_attempt_step_data表' => [
                //        'id' => 'id,exam_classroom_question_attempt_step_data表',
                        'answer' => '答案，exam_answer表',
                        'tab' => '答案选项符号，exam_answer表',
                        'img' => '图片id，exam_answer表',
                        'fraction' => '正确答案标记 100 exam_answer表',
                        'stu_answer' => '学生答案标记 100',
                        'sign' => '学生做对了的标记  100'
                    ],
                    ...
                ]
            ],
            ...
        ],
        '题型-填空' => [
            'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [
                'id' => 'exam_classroom_question_attempt_step表的id',
                'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
                'score' => '题分数,exam_classroom_question_attempt_step表',
                'grade' => '该题得分, exam_classroom_question_attempt_step表grade字段',
                'qtype' => '题型，exam_question表',
                'questiontext' => '试题名，exam_question表',
                'img' => '图片id，exam_question表',
                'generalfeedback' => '试题解析,exam_question表',
                'remarks' => '老师批语',
                'option' => [
                    'answer' => ['答案2，exam_answer表', '答案1，exam_answer表'],
                    'stu_answer' => ['答案，exam_classroom_question_attempt_step_data表', ...],
                //    'id' => 'id,exam_classroom_question_attempt_step_data表',
                ]
            ],
            ...
        ],
        '题型-判断' => [
            'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [
                'id' => 'exam_classroom_question_attempt_step表的id',
                'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
                'score' => '题分数,exam_classroom_question_attempt_step表',
                'grade' => '该题得分, exam_classroom_question_attempt_step表grade字段',
                'qtype' => '题型，exam_question表',
                'questiontext' => '试题名，exam_question表',
                'img' => '图片id，exam_question表',
                'generalfeedback' => '试题解析,exam_question表',
                'remarks' => '老师批语',
                'option' => [
                    [
                        'answer' => 'exam_answer表答案',
                        'fraction' => '正确答案标记，默认为100',
                        'stu_fraction' => '学生答案标记，默认为100',
                        'sign' => '学生做对了的标记  100'
                    ],
                    ...
                ]
            ],
            ...
        ],
        '题型-匹配' => [
            'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [
                'id' => 'exam_classroom_question_attempt_step表的id',
                'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
                'score' => '题分数,exam_classroom_question_attempt_step表',
                'grade' => '该题得分, exam_classroom_question_attempt_step表grade字段',
                'qtype' => '题型，exam_question表',
                'questiontext' => '试题名，exam_question表',
                'img' => '图片id，exam_question表',
                'generalfeedback' => '试题解析,exam_question表',
                'remarks' => '老师批语',
                'option' => [//子题
                    'sequencenumer题序，exam_classroom_question_attempt_step表' => [
                    //    'id' => '子id，exam_classroom_question_attempt_step表的id',
                        'sequencenumer' => '题序，exam_classroom_question_attempt_step表',
                        'questiontext' => '试题名，exam_question表',
                    //    'answerid' => '答案id，exam_answer表id',
                        'answer' => '答案, exam_answer表answer',
                        'stu_answer' => '答案, exam_answer表answer',
                        'grade' => '该题得分, exam_classroom_question_attempt_step表',
                        'sign' => '学生做对了的标记  100'
                    ],
                    ...
                ]
            ],
            ...
        ],
        '题型-简答' => [
            'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [
                'id' => 'exam_classroom_question_attempt_step表的id',
                'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
                'score' => '题分数,exam_classroom_question_attempt_step表',
                'grade' => '该题得分, exam_classroom_question_attempt_step表grade字段',
                'qtype' => '题型，exam_question表',
                'questiontext' => '试题名，exam_question表',
                'img' => '图片id，exam_question表',
                'generalfeedback' => '试题解析,exam_question表',
                'remarks' => '老师批语',
                'answer' => '参考答案，exam_answer表',
                'stu_answer' => '学生答案'
            ],
            ...
        ],
        '题型-综合' => [
            'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [
                'id' => 'exam_classroom_question_attempt_step表的id',
                'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
                'score' => '题分数,exam_classroom_question_attempt_step表',
                'grade' => '该题得分, exam_classroom_question_attempt_step表grade字段',
                'qtype' => '题型，exam_question表',
                'questiontext' => '试题名，exam_question表',
                'img' => '图片id，exam_question表',
                'generalfeedback' => '试题解析,exam_question表',
                'remarks' => '老师批语',
                'option' => [
                    'sequencenumer 题序，exam_classroom_question_attempt_step表' => [//子题
                        'answer' => '参考答案，exam_answer表',
                        'stu_answer' => '学生答案,exam_classroom_question_attempt_step表'
                    ],
                    ...
                ]
            ],
            ...
        ],
        '题型-阅读理解' => [
            'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [
                'id' => 'exam_classroom_question_attempt_step表的id',
                'sequencenumer' => '在某一题型中的题序，exam_classroom_question_attempt_step表',
                'score' => '题分数,exam_classroom_question_attempt_step表',
                'grade' => '该题得分, exam_classroom_question_attempt_step表grade字段',
                'qtype' => '题型，exam_question表',
                'questiontext' => '试题名，exam_question表',
                'img' => '图片id，exam_question表',
                'generalfeedback' => '试题解析,exam_question表',
                'remarks' => '老师批语',
                'optiong' => [//所有子题
                    'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [//选择
                        'id' => 'exam_classroom_question_attempt_step表的id',
                        'qtype' => '题型，exam_question表',
                        'questiontext' => '试题名，exam_question表',
                        'img' => '图片id，exam_question表',
                        'option' => [
                            [
                            //    'id' => 'id,exam_classroom_question_attempt_step_data表',
                                'answer' => '答案，exam_answer表',
                                'tab' => '答案选项符号，exam_answer表',
                                'img' => '图片id，exam_answer表',
                                'fraction' => '正确答案标记 100 exam_answer表',
                                'stu_answer' => '学生答案标记',
                                'sign' => '学生做对了的标记  100'
                            ],
                            ...
                        ]
                    ],
                    'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [//填空
                        'id' => 'exam_classroom_question_attempt_step表的id',
                        'qtype' => '题型，exam_question表',
                        'questiontext' => '试题名，exam_question表',
                        'img' => '图片id，exam_question表',
                        'option' => [
                            'answer' => ['答案2，exam_answer表', '答案1，exam_answer表'],
                            'stu_answer' => ['答案，exam_classroom_question_attempt_step_data表', ...],
                        //    'id' => 'id,exam_classroom_question_attempt_step_data表',
                        ]
                    ],
                    'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [//判断
                        'id' => 'exam_classroom_question_attempt_step表的id',
                        'qtype' => '题型，exam_question表',
                        'questiontext' => '试题名，exam_question表',
                        'img' => '图片id，exam_question表',
                        'option' => [
                            [
                                'answer' => 'exam_answer表answer',
                                'fraction' => '正确答案标记，默认为100',
                                'stu_fraction' => '学生答案标记，默认为100',
                                'sign' => '学生做对了的标记  100'
                            ],
                            ...
                        ]
                    ],
                    'sequencenumer在某一题型中的题序，exam_classroom_question_attempt_step表' => [//简答
                        'id' => 'exam_classroom_question_attempt_step表的id',
                        'qtype' => '题型，exam_question表',
                        'questiontext' => '试题名，exam_question表',
                        'img' => '图片id，exam_question表',
                        'answer' => '参考答案，exam_answer表',
                        'stu_answer' => '学生答案'
                    ]
                ]
            ],
            ...
        ]
    ]
------------------------------答卷批改主观题------------------------------------exam::answerSheet::correctSubProblem
//(请求数据)
[
    'id' => 'exam_classroom_question_attempt_step表id',
    'grade' => '该题得分',
    'remark' => '老师批语',
]
//(返回数据)
返回成功或失败原因

------------------------------某试卷场次的答卷------------------------------------exam::answerSheet::sheetIndex
//（请求数据）
[
    'id' => 'id，exam_classroom_project表id，exam_classroom_quiz表id',
    'examtype' => '0 测试 | 1 考试',
    'class' => '班级id，可不传',
    'status' => '试卷状态，0，没有提交；1，已经提交（可不传）',
    'grade' => '学生成绩批次（可不传，传时，看配置文件：grade_layer）',
    'number' => '学生学号，可不传',
    'name' => '学生姓名，可不传',
    'page' => '页数，默认为1',
    'rows' => '每页数据条数，没传时，使用配置',
]
//（返回数据）
[
    'page' => [
        'total' => '总条数',
        'per_page' => '每页数据条数',
        'current_page' => '当前页码',
        'last_page' => '最后一页的页码',
    ],
    'data' => [
        [
            'id' => '答卷id，exam_classroom_quiz_attempts表id',
            'number' => '学号',
            'name' => '学生姓名',
            'classname' => '班级名',
            'starttime' => '学生开始考试时间，Y-m-d H:i,exam_classroom_quiz_attempts表',
            'limittime' => '学生答卷时间，XX分XX秒，exam_classroom_quiz_attempts表usedtime',
            'status' => '学生试卷提交状态',
            'grade' => '学生成绩'//
        ],
        ...
    ]
]

