<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

return [
    // +----------------------------------------------------------------------
    // | 通讯设置
    // +----------------------------------------------------------------------
    //
    'app_id' => '123',
    'app_name' => '',
    'app_url' => '',
    'api_key' => '345key',
    'user_list' => ['uid', 'username', 'idnumber', 'pid', 'address', 'picture', 'description', 'education', 'enter_time', 'logintime'],
    //权限控制
    'not_auth_module' => 'INDEX, API', //无需认证模块
    'host_name' => Request()->domain(),

];
